{"/about/":{"data":{"":"喻氏二子轶，06年生于江西南昌，小学时参加星火英语竞赛，初中时参加美国大联盟数学竞赛，高中时获得市三好学生，本科杭州电子科技大学，四六级已过，驾驶证已拿\n联系方式：（需要电脑邮箱打开）\nQQ邮箱 Gmail邮箱 网易邮箱1 网易邮箱2 工作室认证： 0verDay_y1s","2025-global-game-jam#2025 Global Game Jam":"时间：2025.1.17 - 2025.1.19\ngamejam主题：Buble\n作品名：SCUM浮沫\n作品类型：视觉小说\n职责：UE主程\n没想到还留下来了 在48小时内攻克3D ui的搭建和可复用的手机屏幕形式的互动面板，并为文案输入和特殊效果插入（如某段手机对话后转四格漫画等）提供了策划友好的接口\n作品：已丢失💦 （因为当年只有我一个写程序，所以没用GitHub，后面电脑重装了就没保留下来）","2025-taptap聚光灯21天gamejam#2025 TapTap聚光灯21天gamejam":"时间：2025.10.10 - 2025.10.30\ngamejam主题：BUG？你确定这不是bug吗？\n作品名：DebugDeadline\n作品类型：卡牌+模拟经营\n职责：主策+Godot副程+副美\n在三天内提出并完善符合主题的策划案，包括但不限于玩法，系统，数值，文案，参与到程序核心框架的构建中，设计了游戏的ui布局及操作逻辑，额外负责了程序化动效的制作\n作品：\n策划文档 ↗ 飞书 项目仓库 ↗ GitHub 发布页面 ↗ TapTap","2025-taptap聚光灯48hgamejam成都场#2025 TapTap聚光灯48Hgamejam成都场":"时间：2025.12.19 - 2025.12.21\ngamejam主题：模拟器\n作品名：我是哥布林（哥布林模拟器）\n作品类型：2D横板动作\n职责：系统/数值策划+Godot副程+副美\n快速将玩法策划的游戏描述转换成程序可写的各个系统，短时间内多次迭代产生可用的数值策划案，程序方面负责游戏的科技树系统和敌人ai系统，美术方面负责将原始素材转换成适配引擎和游戏的素材\n作品：\n策划文档 ↗ 飞书 项目仓库 ↗ GitHub 发布页面 ↗ TapTap","soulofcard牌魂#SoulOfCard牌魂":"时间：2025.6.22 - 2025.8.26\n游戏类型：卡牌对战+自走棋\n职责：主策+Godot副程+副美\n融合炉石传说和自走棋的棋牌类游戏，实现了可与玩家对牌的简单ai，仅支持单人本地游玩，开发到了demo程度，可以体现游戏核心玩法\n主要负责玩法，系统，数值，文案的策划工作，参与了游戏框架的构建，设计了游戏的ui和操作逻辑\n攻克难点：既有标准又有创新的卡牌数据和效果，类杀戮尖塔的关卡设计，基于Node的动态反射，有限空间（手机）内的完备操作逻辑\n策划及程序文档 ↗ 飞书 项目仓库（无完整包体） ↗ GitHub","twokings双王之战#TwoKings双王之战":"时间：未知（因为最早的库已经删了） - 2025.5.25\n游戏类型：棋类\n职责：主策+Godot副程+主美\n像素风，对标象棋的新型棋类游戏，规则完全创新，在7x7的棋盘上对称地进行回合制的双人博弈，仅支持远程联机双人游玩（联机服务已部署在服务器上，但现在服务器应该在运行其他的东西，需要开一下才能玩），开发到了可游玩的程度，且未闭合逻辑，可扩展开发\n主要负责玩法与系统的策划工作，搭建游戏本地部分框架和部分棋子算法的程序工作，ui与棋子素材的美术工作\n攻克难点：自创的全新棋子逻辑，广度优先算法（洪水算法），手绘帧动画\n项目仓库 ↗ GitHub","参赛经历#参赛经历":"","项目经历#项目经历":""},"title":"关于"},"/before18/":{"data":{"":"","中考#中考":"在中考之前，我们经历了两次模拟考，一次是全市对比，一次是本校对比，第一次次我没有上到我们那最好的高中的线，第二次上了\n我们那的高中是这样的，只有三个公立学校给你选，一中，二中，三中，一中最好，有清北92双一流，二中垃圾最吊的是211，三中直接毕业打螺丝\n所以假如我中考出现什么失误的话，我就只有两条路可走（别跟我谈什么旷野轨道，你滚去辍学，我不去），一条是上二中（稳上二中的底气我倒是有的），另一条是去私立高中（可能出生率加死亡率大于一本率的那种学校）\n我们中考的作文题目和一只鸡有关，好像是一只鸡喜欢在夜里叫，于是家里人便把这只鸡卖了，好像是这样的，我不想查\n重点是你猜猜我写了什么作文，嘿，我这b崽子写了篇小说上去，你说，我说，什么罐头我说，what can I say啊？！\n我理所应当地落榜了\n我想自杀\n我决定去一所出生率加死亡率大于一本率的私立高中","云青青兮欲雨水澹澹兮生烟#云青青兮欲雨，水澹澹兮生烟":"高二考试只看选的六科，我本想选物化地，但可惜师资不行，我被迫选了物化生，生物是我的弱项，学着实在难受\n我走上了登神长阶\n至少在我那个学校是这样的\n“起初人们以为这只是平平无奇的，姓喻的人当了一次月考全校第一的事，但后来他次次都是第一，事情就开始变得不对劲起来”\n不严格意义上来说，我当了两年的全校第一\n此谓“云青青兮欲雨，水澹澹兮生烟”\n这是我高考的基石\n但我还是想说另外一件事","人云亦云#人云亦云":"在这里我会挑出一些对我仍然有深远影响的人，只有一点，你若想看完，也不会占用很长的时间","共学党#共学党":"这无疑是我初中的一个重大转折点了，说起来也确实奇怪，这个重大转折点的持续时间是真的长\n共学党是一个组织，一个以学生群众为主体的共学主义组织，党章是我起草的，但是现在应该找不到了，它的前身是拜Kealthy会，一个以教师Kealthy为核心的亲教师派，\n你可能会说，叽里呱啦什么乱七八糟的，哎，你只需要知道有这两个组织就行了，剩下的我来补充\n在初二，我们6班遇上了一个s体育老师，在体育课上他要求我们疯狂跑圈（不过他对跑圈的人还是睁一只眼闭一只眼的，就相当于走也行）且没有自由活动时间，这时就有一个英语老师站了出来，她要抢走我们的体育课，这要放在其他正常点的班级，肯定是一件怨声载道的事，但我们摊上了这样一个体育老师，对比之下，大家纷纷拥护起这位英语老师，她英文名是Kealthy，于是便有三个学生在一节没有被Kealthy解放的体育课上，众目睽睽之下，拜天拜地，成立组织，史称“拜Kealthy会”，其中一个人是我\n但是很不巧，在某一次英语早读，由于有一个做英语手抄报的作业在那时要交成果，场面一度混乱不堪（可以说是一片混沌了），Kealthy一怒之下责令全班同学交2000字检讨\n这在细想之下挺合理对吧，只不过字数有点多而已，毕竟是同学有错在先，但是但是，有这么一个群体，他们要在早上早读的时候带扫把下楼清扫班级包干区，当他们下楼的时候，教室一片寂静，他们上楼的时候，教室仍然一片寂静，多了我们敬爱的Kealthy在讲台上怒目圆睁\n我是这些扫地的群体其中微不足道的一分子，当我的同桌告诉我，因为我在早读的时候很吵，所以我要在明天上交2000字检讨时，我直接变沙币了\n后面Kealthy针对此事进行了公开道歉，但还是很可惜，拜Kealthy会就此覆灭了，我们不会再相信一个背叛过人民群众的领导\n于是共学党诞生了，它生根在拜Kealthy会的尸体上，组织成员还是这三个人，只不过他们不会再以老师为崇拜对象了，而是以学生群众\n这个组织后面还经历过一次政变，创始人之一被踢出了组织，后面又引进了一些新鲜血液，这些人大多并没有贯彻共学主义，层层筛选下来只留下来一个，所以现在的共学党依然只有三个人，或许他们在离开校园之后，共学党就不复存在了吧，但我相信，共学主义仍然会变着名字流传在学生中的，学生成为学校的中心，只是时间问题…吗？","初一和晚自习#初一和晚自习":"最终我还是考上了青荷班，但像我前面说的，我不适合这里，我不适合青荷班，这里的学习强度太大了，而我当时还是一个只会玩游戏，和同学胡吹海吹的小屁孩，所以我的初中成绩自然而然地差，最高就是班上20+名，最低都吊车尾了\n初一有自愿晚自习（这个倒是真自愿，不是反讽），我一开始打算的是上两节晚自习向老师证明我爱学习学习使我快乐之后就不去的，但是捏，晚自习有一个点名环节，你猜猜点到了谁，诶，我暗恋的那个，从此我就决定这晚自习有几次我上几次，为了什么？为了向家长老师还有她证明我很上进（不过他们肯定是不会在意我上不上进的）\n你可能会觉得，我上晚自习？！那我的学习是不是就会好起来了，就应该名列前茅，然后引起她的注意，然后两手抓直接走上小说男主的路？\n哦，bro，那是我的幻想罢了，晚自习我常常写不完作业，不是因为时间不够，相反，比我成绩差的人都能写完作业并酣畅淋漓地刷题直到颅内高潮，但我不一样，嘿，我tm在设计游戏本和画火柴人漫画，要我说喻轶这b崽子是真的不吃几堑就不会想上进的（后来的事也确实让我吃尽了苦头，了了几百几千字是道不尽其中的心酸的，我也只能在这里调侃了）\n那时的晚自习我经常和一个青荷考前集训营的一个当时素不相识的同学坐在一起，当时我们常常聊游戏，他聊他玩的游戏，我聊我玩的游戏，然后他玩我聊的游戏，我玩他聊的游戏，两个人就这么交好了，初中的时候我只有一次月考比他高3分还是几分（当时因为这次考试，我调侃了他少说一个月，所以我记得这么清），其余情况下他都是班上名列前茅的存在，截止目前，他在西北农林科技大学，这是后话，按下不表\n我可能只能用浑浑噩噩来形容我初一初二的状态，因为我确实没学什么东西，也和喜欢和几个同学小打小闹，就和…小混混一样？差不多吧，想不到你喻这个老实人也有当混混的时候吧（手动滑稽\n不过现在往回看的话，初一似乎我也受过一段时间的校园霸凌？这方面我记不太清了","初三#初三":"初二期末时有一个直升班考试，通过这个考试的人可以直接被我们当地最好的中学录取，他们中考也只是走走形式，我去考了，没考上，毕竟我初中就学的那样子，能考上的话，直升班的含金量就太低了\n我们青荷班考了将近一个班走，往常可没有这种情况（毕竟我们扩招了一倍），那咋办？有的班人满为患，有的班只剩十来二十个人\n那就并班\n我被分到了七班，青荷班最好的班，这可能是因为我初二期末考试物理得了满分，说到这个考试我又得提起我那个讨人厌的初二物理老师（这里是插叙，我写啥就是啥）\n他是纯粹的舔狗，据初中同学透露，他能记起班上每个女生的名字，但他又经常报错班上男生的名字，不管物理成绩好不好\n他曾经拿着我的物理“实验班”（一本习题册，挺难的）质问我是不是抄答案的，言外之意就是以我这种人的成绩和学习力是不可能写得了这么难的题目的，更别说是全对，我怎么回答的呢，我在期末考试考了个物理满分，当时他的脸色可不好形容\n好了，说回七班，由于我相当于插班生，第一件难事就是选位子，我尽可能选了一个旁边没有女生且地理位置偏远的位置\n但很可惜，老师后面还是把我调到了一个同桌全是女生，纬度靠近讲台的位置\n很不巧，我的左手同桌就是她\n没错，就是她\n我想，我的整个初三都可以围绕她来写\n我们先说位置吧，七班的位置分为三组，每组之间用走道隔开，每组的列分别是3，4，3，我们换位置的机制是每两周所有人的位置向靠门方向移动三列，这就导致有的时候我会只有一个同桌，那样的日子是真的…我想找人聊天，我只有一个同桌，那我找她聊天就是世界上再合理不过的事了\n一个人的情绪如果被别人支配的话，那这个人就没有了灵魂，那时的我，呵…挺好的\n但我后来又从共学党的情报网中知道，在初一初二有人追她，现在这个人在直升班，你可能会想，那我该发奋图强了吧，但很可惜，不要希望初中的我做出任何努力的决定，那时我就是上课假借听课而实际上是看她上课睡觉，下课又和她聊天，每天晚上写作业到深夜则是为了明天早上拿作业给她抄\n期间那个追她的直升班的人曾来过一次，还给她带了奶茶，据一同前来的女同学说是表示爱意的那种奶茶（我对奶茶一窍不通啊，要是我说错了没有这种的话不要拿这个喷我），这位腼腆的男生把奶茶放到她桌上之后还一直在外面偷看她，结果是一直到他离开，她都没有嘬一口奶茶\n然后，在他离开后，她转向我，问我要不要喝这个奶茶\n当时我以为喝奶茶会拉肚子为由拒绝了（别笑说是什么鬼理由，我喝奶茶真的会拉肚子（笑，但是哭））\n对她，我，我不知道该说些什么，或许你会问我，现在还喜欢她吗？我大概只会苦笑两声，然后告诉你以后不要再提她了\n以上，是我的初中","初中#初中":"我后悔上了青荷班\n青荷班是我们那的最好的高中办的，寄生在它的附属中学的一类班，它网罗附近所有小学成绩好的那批人，它每届招两个班，这两个班里每届都有清北生，所以，它的资格考试难度巨大，选拔机制也是尤其苛刻，笔试面试简直就是入职而不是入学，里面的人都是精英中的精英\n我们这届除外\n我们这届扩招了一倍，而且还有很多关系户涌进来，我是被扩招的一员\n可想而知，我到了一个不属于我的高度\n结果一定是痛苦的\n我确信","前言#前言":"你好，我不知道你是谁，但请找个地方坐下，或者躺着，help yourself，接下来的内容不会很短，虽然它仅仅有关于我活过的贫瘠的前17年。\n你可能会说我是标题党，不是18岁前吗？没错啊，18岁前的时间跨度不就是17年\n你可能又想，写自传是一个吃力不讨好的工作，写的好有什么用，写的不好那就更没必要写自传了，那问题来了，干嘛写它？我只是觉得，既然莎比可以写三个人的一天写上成千上万字，那我为什么不能写，我想写，便写了，与看的人又有什么关系呢，你说是不吼，看的人\n现在是2025年的4月12日，我在昨天晚上心血来潮地想写一篇长文配到我刚刚搭建好的个人博客上，于是，便有了以下的杂乱的回忆，你可能会怨恨我写的杂乱，又岂知道我的这17年其实就是杂乱的，我有时甚至会把梦掺到现实中，又有时会把现实当成梦\n这17年\n我们看看吧","后记#后记":"唯物主义，唯心主义，理想主义，现实主义，虚无主义…\n我且问你一个问题，你怎么定义“思想”？\n要我看，思想本质上是工具，它是一种思维定式，但不能定义任何一个具体观点\n任何人都拥有自己的一套思想，好比马克思有马克思主义，我有喻轶主义，但你要问我喻轶主义是什么，我也总结不出来，但马克思可以把他的主义总结出来\n我可以在任何使用使用任何主义来佐证我的观点，或者阐明我的立场，或为我解决问题\n就好比我在思考未来时，我是一个理想主义者，我有那么多的理想要实现，要加把劲，在思考现在时，我是现实主义者，我要清楚地知道我是谁，我能做什么，在思考过去时，我是一个虚无主义者，我认为过去既然无法改变，那就让它躺在那吧，反正世界是虚无的，我不需要为过去的自己悲伤\n最后，大学生好像都要上一门心理健康课对吧（说老实话，我觉得这个课非常浪费时间，从宏观角度讲弊大于利），在某堂课上，老师要求我们写关于“我是谁”的短句，最少好像是20个吧，我不记得了，在此，我想用我写的这些短句给这篇长文作结（或许它与前文某些地方会冲突，但请不要管这些细节）","外公#外公":"我忘记了他的忌日是哪天了，他死于新冠引起的并发症\n我不知道该如何描述他，不知道该如何形容他\n他没能看到我上大学的那天\n他走前，我不谙世事，他走后，我茕茕孑立\n遗憾","大学#大学":"由于只能写18岁之前的，所以这里是不能直接写到现在的\n我的专业与游戏基本无关，但是由于我从小就爱玩游戏，我爸又是信息处的，所以有时我爸周末加班，或者暑假寒假当班，我就可以跟着去玩一天的游戏，对，不夸张，就是一天，10到12小时的游戏时间，中间吃泡面休息一下就继续玩，我可以说那段时间4399主页上的游戏没有我没玩过的（女生游戏除外），就连类传奇游戏我都试过，真的是一刀爆一地的装备（bushi\n再加上愤世嫉俗，这个世界不可能成为乌托邦了，至少在我活着的时候不会，那我只好自己创世，游戏便是这样的，我是游戏开发者，那我便是创世神，这是任何事情都不能带给我的感觉，我要在游戏中创立一个乌托邦\n上大学前我被拉进了杭电一个学生组织，这个组织的关系网里能人异士挺多的，我就趁机加到了一位游戏技术策划的qq，自此我就走上了游戏开发这条不归路，先是ue蓝图，再是unity，再到现在到godot，专业知识也从数字媒体，串到软件工程，再到计算机图形学，我基本把能涉猎的东西涉猎了个遍\n但我依旧在黑夜下龋龋独行着，还是没有人能帮我，还是一切只能靠自己，这后面的事，或者几年，或者几十年，到那时候再说吧…\n以上，是我根据教育时间线理出来的17年","学海无涯#学海无涯":"","家庭#家庭":"说到底，我讨厌我父母\n我知道这在道德里是不对的，虽然我鄙夷“道德准则”这个东西，但我依旧认同这一点，所以我还是会尽所谓的“孝道”，尽量不去表现我对他们的讨厌并且会尽力给他们一个好的晚年\n（也就是因为他们，我才觉得钱很重要，假如他们都不在的话，我就不会在乎我有多少钱，毕竟我对自己的死一直都是很宽容的）\n我的父母总喜欢搬弄是非，喜欢用一堆老到不能再老的理论和现实来说现在这个日新月异的社会，还喜欢否认一些板上钉钉的事实（比如高中学到的知识下辈子都用不上），你可能会说“不听老人言，吃亏在眼前”，但我初中就是听他们的，结果呢，我高中则是自己对自己的再教育，结果又是怎么样，显而易见\n或许是有我哥这个中山大学高材生的存在，他们在小学初中一直对我的成绩寄予厚望（初中青荷班更甚），在拿我和其他高材生对比的同时一边鼓励我一边贬低我（毕竟我初中成绩就是比不上那些高材生），然后在看到我去了一所出生率加死亡率大于一本率的高中后就对我冷嘲热讽（比如这辈子能上大学就不错了什么的），我及其厌恶这一点，及其厌恶\n搞歧视的人应该和畜牲坐一桌\n甚至还有，我17岁的生日\n任何人都可以预见的，我的17岁生日大概率是我在家里过的最后一个生日\n但很可惜，这是我前17年过过的最敷衍的生日，导致我18岁干脆就没有过生日，确定了一下游戏实名认证就没有什么特殊活动了，那时我很沮丧，或许以后每年我的生日都会是我的沮丧日\n有一个这样的原生家庭在我主观看来是可悲的（或许你会想说这已经是正常范畴了好吧，人要知足什么的，但我就是，不喜欢这样的家庭，他们经常拿我和其他高材生比，但这些高材生显然有一个比我更好的家庭，但他们就是把我哥这个偶然事件当成理所应当，或许他们还认为他们的理论能把任何人都培养成高材生，可笑），所以当我知道我的某个高中室友有一个更惨的原生家庭时，我尽量包容他的任何缺点，虽然我后面为了不影响我的学习还是换寝了（因为和他相处还是太消耗我的精神了）","小学#小学":"小学六年呐，那事可太多了，但大事却太少了\n关于我是哪个年级离开那栋临时教学楼（应该说是临时教室，因为它只是一个平房）的，我已经记不大清了，反正可以知道的是，从入学到那个年级，9班的教室一直都是一个远离正式教学楼的，附近没有厕所的，甚至周围长满了草，有同学说经常在周围看到蛇的，只有一层的平房\n而我，是9班这个老师带过的最差的一届班级的一员\n一年级，我们教室周围没有厕所，要上厕所只能去遥远的教学楼上（其实不遥远，但基于一年级学生的体质，当我跑到教学楼上完小的再跑回来时，上课铃就会恼人地吵起来，导致我没有时间去玩），所以，为了不浪费宝贵的课间时间到上厕所上，我决定，就地解决！\n是的，就是就地解决，当时的我可以说是既害臊又不害臊，若我想上小的，我会到教室楼房的后面那块经常有人说看到蛇的草地去解决，有的时候就会不碰巧地被一些去教学楼上厕所的男生女生看到…但我stick to my position，这个解决方案在教室附近建起临时厕所前我一直用着\n后面得说起小学的两个重大转折点了，恕我的长期记忆力不是很好，我实在记不得这两个转折点哪个前哪个后了，所以我就随便挑一个先开讲","幼儿园#幼儿园":"2006年11月1日，哦，真是个不吉利的日子，那么多1，你怎么不双11出生呢，非得留个0当遗憾…农历9月11日，更不吉利了，多好的911，使飞机碰撞箱与大楼刚体重叠\n伤春悲秋，秋是用来悲的，哈，我的人生是用来悲的，此言不假\n我们直接略过许多，从幼儿园开始\n我在幼儿园加了两个个兴趣班\n一个是学心算和算盘的，我对那个地方最深的印象是我和几个要好的同学经常在上课时离开座位，排成一条龙悄悄摸上讲台，然后跟着老师在黑板上板书的运动轨迹左右摆，在老师快结束板书的时候又冲回座位上，是的，就是这样，我现在回忆起这个就跟梦一样，真的很逆天\n但就是这样一个学生后面还是得了“初级心算小能手”的奖状，并确实可以秒算很多个多位数的加减（有多多呢？差不多10个3或4位数算加减那样的程度），不过现在你叫我展示一下的话，我肯定展示不出来了，小学的时候就已经丢掉了（笑\n另一个兴趣班是学画画的，呃，更确切的讲应该是学上色的，我印象中没画过什么画，就是画了也没保存下来，在这里我经常展现出我乐善好施的天赋，将我本就不多的水彩笔分享给其他同学（不管是认识的还是不认识的）\n于是就经常有水彩笔找不到的情况，甚至乎在某次急匆匆的借笔中，某个同学还把我的水彩笔盒子摔裂了一块，当时我婆和我爸就告诫我说管好自己，不要借给别人东西\n但我还是会借，没办法，谁叫我这个人就是这样，只是借给别人的时候更小心谨慎了些，会在脑子里记下借笔的人的名字和借了哪个颜色的笔，或许我的速记能力就是从这里开始培养的吧（笑\n接下来我们把时间轴推到小学","我和她和她#我和她和她":"没错，是两个她，我没打错你也没看错，我会在这里写完我可悲可笑的恋爱历程\n在高二时，我鼓起勇气通过某些关系网拿到了她的qq号并加上了\n我向她倾诉了我高中经历的种种，当时我们的关系还是挺好的，就相当于好朋友吧（唉，朋友，唉），在加上她qq后我每周回家（我们高中学校是寄宿制的）都会和她聊天，对，每周，我就是这么能坚持，特别是高二还有一段疫情，那时就是天天我都聊，当然，我不知道她想不想聊….\n那时我天真地以为聊久了就会日久生情，我还是太幼稚了\n然后我就在一次月考向她炫耀成绩后侧面表白了，具体情况是她问我为什么成绩好，我说是因为她（别看我这里说的这么少，但我可是写了好几页qq聊天记录来阐述并论证这个观点（笑，然后哭）），然后两个人就balabala的\n最后结果就是“我不想谈恋爱”，“当朋友不好吗”\n完美的复刻！复刻谁，复刻什么事我不说，自己体会\n后来我们两个的关系在这之后渐渐冷下来\n在高二时我想补上她在我心里的空缺，于是我便假借“一见钟情（见色起意）”为由想和我的一位高中同学谈（其实是因为在她离开我心里心里之后，我又在另一个她身上看到了她的影子）\n我也在刚表明来意之后就和她谈了她的事（向第二个她说第一个她）\n但如我前面所言，我们这个高中的人成绩都太差劲了，所以假如要长远打算我就得想办法提高她的成绩，那咋办？老师都是烂老师，咋办？我自己教\n我自己教或许耗了我很多时间，但有一说一对我还是有点帮助的，这和在编程时放一只猫在旁边向它解释代码有异曲同工之妙，这就是费曼学习法的简化版\n但我还是觉得自己被利用了（或者说被自己戏弄了），我谈恋爱是为了学习，我学习是为了谈恋爱？什么无限递归函数？！\n然后我又干了一件蠢事，我觉得没有人理解自己，于是我向她倾诉，呃，是第一个她（向第一个她说第二个她）\n在和她分手时（其实根本没有明确地谈，也不能说分手），我又和她说了她的事（再次向第一个她说第二个她）\n哈，是不是很沙币\n可悲又可笑\n后来啊，第一个她考去了南昌大学，她在高考后把我的qq删了，我曾试过加回去，没有成功，第二个她我不知道去了哪，反正不是一本，现在还有qq，但是这辈子应该不会再联系了","我是#我是":"我是人\n我是一个中考失利的人\n我是一个靠自学翻身的人\n我是一个不依附于他人的人\n我是一个不服从权威的人\n我是一个有梦想的人\n我是一个理想主义者\n我是一个唯物主义者\n我是一个想做二把手的人\n我是一个对自己要求高的人\n我是一个经常焦虑的人\n我是一个失去初恋的人\n我是一个不相信命运的人\n我是一个对人平等的人\n我是一个挑战上位者的人\n我是一个不服输的人\n我是一个不惜代价的人\n我是一个有悲悯之心的人\n我是一个从痛苦中获得乐趣的人\n我是一个追求自由的人","暗恋#暗恋":"不记得几岁，更不记得几年级，那时正是补课现象猖獗，补课机构收入堪比开矿的年代，我爸，或许也有我妈，决定把我丢去小星星补课机构，学啥？学英语。我不知道这样做的目的是什么，或许是老生常谈的赢在起跑线上，又或许只是让我少烦他们，抑或是我的两天的假期时间让他们眼红了（bushi），亦或是其他什么原因比如看其他孩子都去补了于是跟风让我也去补，反正祸根从此种下，补课的种种经历是我探及自己性格形成原因时逃不开的话题\n起初小学还是幼儿园学的小红帽白雪公主英文版，后面就学领跑，再到领跑提高班（说着很高大上，其实教材都不知道是哪来的，我甚至都觉得是补课老师聚在一起自研的）\n领跑提高班，我在的是一个挺压抑的班级，至少我这么觉得，当时老师似乎是要求写完书上的题才能在放学的时候走的，但有时我死活看不懂书上的单词，急得跺脚\n后来有一个小星星自己的大考，根据考试成绩分班，好的一批放一起，学新版新概念（就是青少版），差的一批放到一起，学老版新概念（那个封面上四个圈，看着就让人没有食欲的的版本）\n很不幸地，我因为某些原因没有考好（这些原因和知识关系不大，和性格关系大，就是我的一身反骨驱使我去觉得这张考试卷子有些题出的不准确，模棱两可，所以我决定按我所想的写而不是按考试题目来写，并寄希望于改卷老师能看到我的答案然后反思他的题可能出错了然后只给我分不给其他根据考试题目写的学生分，是的，当时我就是这么犟），离90差一两分（满分100），但只有90分以上的人才能分到好班，于是我理所应当地被淘汰到了差班（不过也没有差的离谱就是了，反正人均素质成绩是比我高中高的）\n然后我就学旧版新概念学了好几年，一直学到初二，直升班考试前，我学完了新概念一二两册\n上了初三，我就没有补课了，一直到高一我又回归补课机构补了一丁点，后来就没去过补课机构补课了，到了高二更是只到私人补课的地方补了\n“Stop！打住！你标题不是暗恋吗，你写的啥，这里有提到人吗，这不是补课吗，你干脆把小标题改成补课得了，死标题党，吃我一拳！”\n莫急，兄弟莫急，这行文里处处无她，在我眼里却写尽了她口牙\n或许是领跑提高班，或许是这之前的某个班，但我这里就写领跑提高班这个确定的转折点吧，我和她都在这个领跑提高班\n课程计划到一半，或者是临近期末，我注意到了她，在这之前我可是认真学习的好学生嗷\n我喜欢她\n我不懂喜欢是什么，我不懂男男女女，我不懂天若有情，我不懂人间沧桑，但我就是喜欢她，我不知道为什么喜欢她，不知道喜欢她的哪里，我只知道，我喜欢她\n但正是因为我不懂这些种种，我什么都不懂，我不知道怎么向她表示喜欢，我也不知道什么提升自己来吸引他人，我不会a上去，也不会发育加一波，我是沙币，于是接下来到来的就是\n无可救药的暗恋和异想天开的意淫\n后来者写这些就是容易站在上帝视角看这些蠢事，我不怪那时的喻轶，他这么做有他的理由，虽然他现在已经死了，那年的喻轶和一些喻轶死在了高考后的那个暑假，尸体由我亲自埋葬，这些都是后话\n我开始做一些痴心妄想者做的事，这些事我就不写了，男看男鄙夷，女看女恶心，我看我悲哀，她看…还好她不会看的\n补课的时间是短暂的，我只能通过寄希望于和她在同一个班的时间多一点来满足我喜欢她的欲望，可惜天不遂人愿，我在分班大考中被分到了差班，而她被分到了好班，没错，就是那场我考差了的大考，后来想想…算了还是不想吧，相信这是最好的安排\n然后我就疯了（不是那种疯嗷，这里只是非常夸张而已，我很确定我是一个冷静的人（笑））\n后来的新概念课其实我都是心不在焉地听的，但鉴于课太多了（想象一下，两本新概念，每篇课文都上两个小时，你看看有多少次课吧），再加上新概念课会要求每天听15分钟课文录音（这件事我坚持了2年，两年的每一天晚上睡觉前都会用我那个老年机放，就是拿这个当安眠药吃，效果极佳，大多数情况下都会放到下一天早上，因为有时没关就直接睡着了），就是再傻的人，上了这么多课，听了这么久录音，也会培养出人们常说的很难培养的“语感”，没错，我的英语语感就是这么来的，有部分原因是拜她所赐\n为什么我上这么多课？没有她在的课不是更难过吗，那我不应该从此以后再也不补课吗？哦，我不是这样的，我只是异想天开的认为好班可能会和我们一起上下课，然后或许我就有机会在上课路上或课间或下课路上看到她，没错，就是这么个事，我是沙币\n和她的事在小学就是这么点，有一些无关紧要的比如我们三兄弟满教学楼跑的时候我会看到她，比如有时放学后我们三兄弟玩很久后我回家路上看到她从琴行上完课出来，这些事里我和她都没什么大的交集，所以就不写了，要真说到交集，请看初三\n以上，是我的小学，和幼儿园并称我最轻松的两个时期","标杆#标杆":"本来吧，这个标题是想写“偶像”的，但这容易和某些男不男女不女的类人挂上钩（他们把这个词玷污了），所以我还是改成“标杆”好了，至少这样没有歧义\n我崇拜的作家从上往下排下来前三是鲁迅，余华，余秋雨，后面的那些我就不提了，要提的话能再写一篇文出来\n鲁迅的文章嘛，在知乎上有个很好的比喻，我找不到了，我改了改就是：好比一根骨髓健壮的硬骨头，要是熬久了能吸到极少的极腥的骨髓，但若没有耐心不想熬它，也可以拿着这根骨头到处敲人\n余华的文章对我就好比一剂苦药，也不算药，就是苦，苦到我在喝完它后能耐受住这✓十的世界，我前文也说了，高考那段时间我就是考着余华的《活着》续命，你要问我从里面学到了什么？我只能说我知道我还不配死\n余秋雨嘛，本来在初中我们语文老师就给我们打印过《文化苦旅》的《风雨天一阁》，当时的我，不喜欢看散文，散文又没营养（比如看议论文可以学“真理”），又没有引人入胜的剧情（小说也没营养，但它能拿来消磨时间），但我在看了这篇文章之后想法就改变了，因为这篇散文兼具上面的两个优点，又有营养，又引人入胜（简直和迅哥儿的小说一样）\n（别看我越喜欢的写的越少，他们都是顶级作家我怎么敢评的啊喂）","校园结义#校园结义":"三年级，不记得上学期还是下学期，有三个莫名其妙认识的，莫名其妙关系很好的，相同点应该只有都戴红领巾穿校服的小学生，下课时他们经常聚在一起，玩其中一个人迭代了十来版的纸上游戏，小兵大战（有的时候会玩其他的，但这个是最经典的）\n他们成立了一个游戏组织玩这个游戏本，起初叫罗大屁集团，最终boss是罗小屁和罗中屁，后来我们的老大一拍脑子改国号为四维（其实不是国号，只不过是把自己的外号改了），我们就叫四维集团，对头是罗大、中、小屁（不过这倒是四年级或五年级的后话了）\n在一个阳光明媚的早晨（或许是大课间？），这三个都读过三国演义的小孩都拍了一下自己的脑袋，他们脑海中浮现桃园结义的大场面：那时正值桃花盛放之季，两个大汉和一个弱男子齐聚桃园煮酒，三人喊着“不求同年同月同日生，但求同年同月同日死”的豪言，决定从此同生死，共患难\n然后一切就都自然而然的发生了，三个被自己洗脑的小孩一下课便齐刷刷地跪在教室后门的外面，后面的事不需多讲，你大概也能脑补出一些场面，这件事过后，太史公便在棺材里曰：此谓“校园三结义”是也\n这三个小孩截止目前，一个在西北大学，一个在杭州电子科技大学，一个在华中科技大学，后话就待几年或几十年后再来写吧","熊咆龙吟殷岩泉栗深林兮惊层巅#熊咆龙吟殷岩泉，栗深林兮惊层巅":"我是以全校第二还是全校第三的成绩进来的，学费免了很多，但最让我欣慰的是竟然还有和我一样不长眼的学生会来这个学校\n高一时我们的教师阵容非常豪华，我们一一说\n语文老师是省语文组的，具体是怎么个事我也不清楚，反正老谋深算\n数学老师是北师大硕士高材生，学历是我们教师阵容最高的，资历是最浅的，这个是本事最低的，后面我们细嗦\n英语老师是几年前高考文科状元的英语老师\n物理老师英语老师老公，地位相同\n化学老师是一中退休老师，资历最老，这个老师我最讨厌\n生物老师我没怎么关注，因为我一开始是想学地理的\n政治老师是一个呃，形容不了的人，新生代好吧，新生代，没资历\n历史老师是一个富二代，体验生活来的\n地理老师是理科男神，曾在数学省赛因为看别人打篮球迟到半小时并提前半小时交卷继续看别人打篮球的情况下斩获数学省二，物理省一，我不知道为什么他要教地理，他还有自己的一套思想，有自己写的书，我想选地理的原因的大头就在他身上\n为什么这些这么吊的老师会来我们这个出生率加死亡率大于一本率的地方？我们的物理老师告诉我们，以前他教的都是些极好的生源，体现不出他的实力，于是他必须要来这样的一个垃圾学校教出几个92来证明自己有把朽木雕出滕王阁的实力，他说我们会是他教的最后一届，把朽木雕成滕王阁是他的理想，于是他带着一众顶尖教师来了\n这个阵容很快就土崩瓦解了，首先是语文老师被挖走了，然后是这个物理老师带着一众他带来的顶尖教师都走了，他们去了开价更高的学校\n哈，这就是他的理想\n我在高一的时候成绩只有一次崭露头角，那次是高一上学期第三次月考，我考了数学校三，英语校一，物理校一，化学校一，地理校一，并在政治落后校二40分的情况下总分领先校二40分，在那时我突然明白，原来我也可以是主角，过去我当了那么多年的配角，当了那么多年的吊车尾，我也可以是第一，我配得上第一，我以后都要当第一\n此谓“熊咆龙吟殷岩泉，栗深林兮惊层巅”\n这是高一唯一的一次高光，后面我的成绩一度陷入长时间的寂静，那是在厚积薄发（不，纯粹是因为我的政治历史太烂了，其他科不爆发的话实在拉不起总分，但总分偏偏是按九科算的，你说我拿什么竞争）\n高一结束之后，那些好老师就走了，剩下了一地的鸡毛","老师#老师":"我给一个概括的印象\n尽管我经常教别人，这也算是某种意义上的“赤脚”老师，但我排斥老师这个群体\n任何我没深入接触过的老师我都会直接把他们视为敌人，不论男女老少，不论资历深浅\n迄今为止我看到的老师和学生的关系几乎没有平等的，都是老师是农场主，学生是农场里的畜牲，或许是我的见识太少了，所以我暂时把这个理论当成“暴论”看待\n老师对学生的影响太大了，这是一个承前启后继往开来的职业，但在人们口中成了什么？公务员的下位替代品？编制？铁饭碗？这和因为大学期间荒废学业玩游戏去了而不是因为想做出令人感动的游戏所以去做游戏开发相关工作有什么两样？！\n“喻轶啊，假如你成绩不好找不到工作，那就去当老师吧。”\n这是我的某个当老师的亲戚的原话，后面同样在学校工作的我爸也复述了很多遍\n孔夫子在九泉之下若是有知…","补课的终结#补课的终结":"在这个不适宜的地方我还想补充一下关于我的补课生涯\n我曾说在高中我也补过一段时间的课，但后面就只补私人了\n这里补充一点，我补私人也没补多久，在高三前就停掉了，具体是什么时候我记不太清了\n高中一开始我选择补化学，我中考化学是拖后腿的，因为化学在初三才学，而初三上课我又去看她去了，导致我初三基本没学化学，我得拿着我稀烂的基础去碰高中化学的硬茬子\n好在我做到了，做的很好，在跟着他学习一段时间后，我成了那个补课班上的化学第一，连那些一中的学子也奈何我不得，我觉得这个老师算是我遇到过的少有的好老师了，讲课是我见过的化学老师中的最好的，同时人也好，反正那那都好\n他本来在黑板上板书过他的联系方式的，但我没有记下来，至今我仍然觉得遗憾，他曾经看着我的卷子对我说，“你高中的化学成绩不会比重点中学的学生差”，从此以后我便发誓一定好好学化学\n在此和某位畜牲数学老师做对比\n但同一个补课机构，同样的学科，后来位尊敬的老师走了，换了一个差老师\n那时我既补了物理又补了化学，我从化学讲起吧\n化学老师是一个差学校的老师，她经常在上课上到半中央不知道自己教案上的题目怎么写，然后就由我们班上一位一中的同学来接题目茬，有时这位一中学子也不会，我就发表自己的看法，哪怕是对的，她也不予理会\n物理老师同理，这位一中同学也和我一起补物理，物理老师也独宠他一人，即使这位学子在上课时玩手机，他也在这位学子解出一道题后向全班宣布要想这位同学学习\n结课的时候要考试，老师会把学生成绩放到家长群里，还会根据学生的课堂表现写评语\n两门考试我都是第一，这位一中学子第二\n他的评语比我长\n我没有细看我的评语，我觉得恶心\n我决定再也不到这个补课机构补课了\n说到我私人的补课就得谈到我另一个喜欢的人了，在下文中会写，但与补课关系不大，毕竟老师挺好的，没有什么槽点，所以也写不了多少","裂缺霹雳丘峦崩摧洞天石扉訇然中开#裂缺霹雳，丘峦崩摧，洞天石扉，訇然中开":"没有补课来消耗我的时间\n没有恋爱来消耗我的精力\n我有着差劲的师资，且我是两年的全校第一，所以我有着上课自习的自由，且我必须上课自习（因为上课学不到什么知识，上45分钟学到的不如我自学10分钟学到的，更奇葩的是我自学10分钟后就可以在下课时用5分钟给上课听了45分钟还不懂的同学完全讲解这个知识点）\n挡在我面前的是两座大山，高考，自己\n我合理怀疑当时的我有抑郁症或自闭症的前兆，我相信大部分临近高考的高中生都多少有一点，我应该也不会是最强烈的那一批\n反正就是我想死\n没有人可以在学习上帮到我，高考只有我自己独自面对\n于是我没日没夜地刷题，有什么刷什么，一天写100面辅导书（53还是必刷题，或者是二者的混合），高三的我做到过，不止一次，我的成绩只能通过刷题+费曼学习法+给同学讲题来提升\n在这里我想附上一张图来让你直观地感受一下\n你可能会说，原来就写了这么点吗，还抄题写，效率真低\n不，这是我的错题本和我的教案，每一道题的解法我都有注解，这还是我高三上学期中间开始写的，图也只是一部分（可能你想问为什么这么糊，原图我找不到了，这是我qq动态里的，已经被压缩分辨率了）\n当时我依靠着余华的《活着》来活着，我想，福贵都那么惨了，还活着呢，我要是因为一个高考就自杀了，那我太废物了（虽然我就是一个废物）\n我本想着周末可以回家玩游戏来降压，可是我那父母以高考临近为由吵吵着让我不要玩，我顶着压力玩他们就更吵吵了，并一致认为我这辈子就只能上大专然后毕业去打螺丝了，所以要我周末也要“好！好！学！习！”，那可好了，我的san值越来越低，san值不够刷题效率就会低，刷题效率低就会焦虑，焦虑找不到方法缓解就想到游戏里杀两个人，但我又不能玩游戏，结果就是死循环，有什么办法呢？让我摊上这样的父母…\n我的高三结束了，或许高考再延后一点的话我真的会自杀\n高考那几天你问我什么心情，我肯定会答没有心情，这是实话，我实在无法描述高考那几天我的心路历程，感觉就是平平缓缓的，毫无波澜\n高考后该配手机电脑了，我的父母一致认为我应该在高考成绩出来后根据成绩来配，因为他们根据我在家的表现（天天玩电脑，说了也死不悔改）一致认为我只配上个大专，所以我理所应当地只配拿几年前就淘汰的笔记本和老年机去用，对，我只配这些，手机和电脑？我这b也配？\n好在我做到了，写到这里我感觉…说不出来的感觉，算了不说感觉了\n高考成绩出来了，江西606，江西考生大约550,000人，我是第8,944名，我不是顶尖人才，但也是我自己的救赎吧，是为“裂缺霹雳，丘峦崩摧，洞天石扉，訇然中开”\n211南昌大学专业随便选，还超出了二三十分\n但我不去211\n一部分是因为父母亲戚那些冷嘲热讽，另一部分是我觉得这个政策211没出路\n我去了杭电，计算机专业，虽然不是计科，但绝对比昌大好","青荷考前集训营#青荷考前集训营":"我想从小学备考青荷班讲起，因为要考青荷班，我的父母还决定让我报小星星的“青荷考前集训营”，在这里怎么说呢，我好像是一班的，然后我暗恋的她在二班，反正我们不在一个班，我知道她在二班还是因为这个集训营在结营时会组织团健一次，我才知道她也在\n再得说这个集训营\n语文老师要求班里的每个学生都上台做自我介绍，这似乎是我这辈子第一次当着二三十个人的面“演讲”，很可惜，我讲到一半就不知道怎么讲了，我的大脑在那时是completely blank，我“唉”了一声，然后下台了\n数学老师是个畜牲\n在小学时我对老师并不非常讨厌，但这个老师让我对“老师”这一职业的厌恶上升到了极点，从此我对“老师”有了一种不可磨灭的刻板印象，对，就是从个人上升到集体\n在某一次课上，某个同学和我说话，被这个畜牲发现了，于是他抄起旁边的凳子向同学砸去，这位同学还算有骨气，背起包转身就走了，我是没那个骨气的，也没有那么强大的反抗决心，这位畜牲便又严词警告我不要和这种人交好\n在同一节课，我做完了畜牲在课堂上布置的当堂作业，于是便看着草稿本走神，不知道为什么，畜牲看着我说“写完了没有”，我回我写完了，它便叫我拿着书上台来给它看，它拿着我的书，又看看自己的书，又看看我的书，把书摔在桌上，给了我一巴掌\n假如是现在的我，假如我带了刀，我非得叫他“流血五步”不可","高中#高中":"“熊咆龙吟殷岩泉，栗深林兮惊层巅”，“云青青兮欲雨，水澹澹兮生烟”，“裂缺霹雳，丘峦崩摧，洞天石扉，訇然中开”\n在高三时，我曾想过把我的高中生活写成一本书，书名都想好了，叫做《群山回响：刀俎鱼肉列传》，但最终还是因为高考的缘故没有动笔，但假使让我动笔，上面的《梦游天姥吟留别》这几句会是开篇词，这三篇或多或少的对应着我的高中三年，一个双引号就是一年\n我本想直接从高一开始动笔，但是我还是想补上一下中考的位置，莫急，很少，我不想放在初中后面，就只好放在这里，见谅"},"title":"十八岁前的\"我\"们"},"/dae/":{"data":{"":"","总览目录#总览目录":"序：台土 初世纪正篇：帝王不孤 《王朝轩辕衍公世家(一)》 《东帝国：乂字军欧荣·海德生平(一)》 《王朝司马相宜公世家(一)》 《王朝轩辕衍公世家(二)》 《东帝国：乂字军欧荣·海德生平(二)》 《第一帝国：第二大帝奥尔科托·尔白传奇(一)》 coming soon…"},"title":"王朝与帝国"},"/dae/century1normal/":{"data":{"":"本篇以一种自创的混乱的形式来写王朝与帝国初世纪的史实，主写从第一帝国乂字军东征到王帝第一次和平中全部上位者的事迹（当然也有下位者）\n王帝从此处开始——\n（一）·《王朝轩辕衍公世家（一）》 王朝 （二）·《东帝国：乂字军欧荣·海德生平（一）》 帝国 （三）·《王朝司马相宜公世家（一）》 王朝 （四）·《王朝轩辕衍公世家（二）》 王朝 （五）·《东帝国：乂字军欧荣·海德生平（二）》 帝国"},"title":"初世纪正篇：帝王不孤"},"/dae/century1normal/passage1/":{"data":{"":"“轩辕公在关西与夷人筑垒相对已有数月，想那夷人驻扎低地，又与其粮草所在之故都相距甚远，远道而来，必疲弊不堪，此时若我等率一部奇兵与轩辕公相应，必能大破夷人，彼时都督既能与轩辕公交好，又能受圣上赏识，何乐而不为？”\n“夷人后营空虚，布兵不当，末将愿率兵于其军后方山顶驻扎，待都督号令，我部冲杀下来，与主军形成合围之势，夷人自会阵脚大乱，到时都督亦得大功一件。”\n“夷人粮草囤积在故都南侧一处高地，末将愿领一千突骑奔袭此地，烧其粮草，到时夷人自会撤军，此时主军若趁势追击，或许还能一鼓作气兴复故都，为先帝雪恨。”\n帐内诸将七嘴八舌，皆意欲出兵奔赴前线。\n“圣上说了，各部兵马不许轻举妄动，你们耳朵是不想要了吗！“都督夐亿将手里的书卷摔在桌上，随后语气缓和些道，“吾受圣上破格提拔为都督不久，若论立功报国，吾亦心切。可这军，是圣上的军，轩辕公私点大军出兵，已是公然忤逆圣上，吾等若再去援护，那便是坐实谋反呐。”\n“圣上登基不久，政务军事冗多繁杂，想必是忽略了兵贵神速，当时轩辕公出兵三战三捷，已证实那时出兵乃是上策，圣上数月不责令退兵，必是默许轩辕公所做皆宜。”\n夐亿瞪了一眼偏将，又扫视诸将，目光所及，无不镫目如铃，口中出兵呼之欲出。\n“吾意已决，各部按兵不动，退下。”\n“陛下，何苦要将轩辕公置于死地啊。“宰相司马相宜，自是站在开国功臣轩辕公这边的。\n“一个国家，不能有两个掌兵的人，司马爱卿，您这又是何苦呢。“殿前踱步者，当朝皇帝子刹，摆弄着手里的半边虎符，尴尬地看着驻立在原地的宰相，“朕当然知道轩辕公不可能兵变，哪怕是您对这朝堂动了念想，他也会毫不犹豫地为朕勤王。可以说，司马氏和轩辕氏都是父皇留下的当朝肱骨，朕若质疑这点，那朕便是昏君，你们自可拿下朕，辅佐朕的弟弟子政代之。”\n子刹手上一滑，虎符跌落到大殿地上，叮的一声虽小，却也震得司马相宜一颤，“还望陛下三思啊，收归兵权一事不妨击退外敌后再作商议，倘若此时轩辕公兵败，各部来不及合军聚众，恐被夷人趁虚而入，到时怕国都有失……”\n“怎么，我偌大的王朝会被一介蛮族伤及国脉吗！“子刹一声断喝，纵是能言善辩者有如司马相宜也吃不下这一吓，三寸不烂之舌急忙缩回口中。\n“圣上息怒，臣有要事禀告。”\n子刹回身一看，转怒为喜，不知何时夐亿已在殿前，“行却无声，都督你这飞贼的本事什么时候也教会我。”\n“圣上还是莫要打趣了。“夐亿拱拱手，“先帝旧部史乾，杜巽，赵符离三路人马已私率亲兵欲汇合轩辕部。圣上，纵吾已三令五申不许出兵，然此三路将军仍率亲军离部，吾也不好带兵阻拦，否则若是起了冲突，那便是兵变了。圣上，对此吾也不知如何是好。”\n司马相宜听罢，明白都督是在请命放过三军，正欲开口向子刹求情，子刹先一步将地上的半边虎符捡起，放在夐亿手中，“都督一职本就应令行禁止，此事，不必多言，若众人执迷不悟有误大局，杀无赦。此举亦可助你在军中树立威望，好事一桩。“说罢，攥紧夐亿的手。\n司马相宜只得再度缄口，看向夐亿。夐亿哀叹一声，待子刹松手后径直走向殿外。\n轩辕公镇守之关唤作囊关，依南北两山而建，地势高峻，囊关以西为王朝故都中陵，现已被帝国乂字军攻陷，以东为王朝现都尔郡。两都之间除却囊关一丘，其余地块一马平川，纵使偶有沟壑土包也难以修营筑寨，又说尔郡向来为商业重镇不曾设防，甚至于连墙郭都没有，故而以此看来，轩辕公领兵先驻囊关乃是阻碍帝国进军的不二之选。\n关内王朝军有步卒射手五千，斥候战车三千，加上轩辕亲军两千，且能凑够万军有余。而关外洼地驻扎有帝国军三部，分别是欧荣·海德所率乂字远征军两万，肯威·康奈特所率教会骑士团五千，威廉·兰斯所收王朝军降部五千，两军兵力悬殊，故而轩辕公也不敢贸然率部冲阵。\n“倘是先帝尚在，我定能以都督之名亲率王朝十万军，席卷这些蛮夷之族。“轩辕公，官及大将军，王朝后代之将亦称之为衍子，本名轩辕衍，中陵人士，早年间随王朝先帝子殇起兵，是先帝座下首席将军，征战无数，王朝初建时首封为都督，赐号轩辕公，而后又因平定贼寇有功，加封地，镇守王朝南方各州郡，允许其编制亲军两千。待到帝国军攻陷故都，先帝子殇驾崩，继位之君子刹以其所处偏远无法领兵来救等为由暂撤其都督之职，由子刹门下禁军统帅夐亿代领。得知此事之后，不日轩辕衍便立率亲军日夜奔赴囊关设防，从卸任数起，到护驾结束，这些事统共耗费轩辕公三日，理亏之处，自然到了子刹那边。\n“衍兄，这定是圣上一时昏庸，欲弃王朝大节于不顾……“衍公之弟轩辕闵，受封侯爵，与殇帝旧时相识，曾向殇帝举荐衍公。\n“或许圣上是听信谗言，我等应率一部回都勤王……“衍公之子轩辕岁需，子刹儿时伙伴，青年时常与子刹、夐亿饮酒论剑。\n“够了，先帝于我等轩辕氏有兴族之恩，就是圣上要推我去斩首，我也无憾，不过外夷当前，我轩辕衍就是抗命，也要打退他们，兴复旧都。“轩辕衍砸了几下桌板，强行让众将安静下来，“我已修书向先帝旧部六将请援，届时待大破这些蛮夷，我再只身回都向圣上请罪。”\n“圣上卸下我等兵权交由一个新将夐亿，这是做何用意，夐氏一区区乡野姓氏，怎和我轩辕氏争权。”\n“先帝尚在之时我尝与之论辩，夐将军精于调兵而劣于遣将，善冲阵而疏布阵，若是论率千来兵卒冲杀，他与我不向上下，但若领十万军团斗阵，他与我等还相差甚远呐，“轩辕衍扫视众将，“可诸位不必多言，夐将军代都督一事，圣上自有定夺。但想必夐都督走马新上任，不知兵权早已分给先帝六部将军与我轩辕氏，待击退蛮夷，我等再听他号令无妨。”\n“诸位，“夐亿将手中完整的虎符举起，“就是不给在下面子，也要遵圣上主意，回营罢，吾以都督之名保证，下不为例。”\n三将先是眺望数十里外的囊关关隘，随后瞥瞥夐亿高举的虎符，发觉夐亿此行未带兵卒，赵符离首先发难，“你是都督，那便更应该知道功于一役的道理，现在战事悬而不决，多少也有你的责任，你不曾受先帝赏识，又怎知我等还于旧都之愿……”\n“战事拖下去对我朝有什么好处，你居心何在！“杜巽不想跟着赵符离耍嘴皮，抬起手中长刀喝向夐亿。\n夐亿收起虎符，抬起手中长枪横在身侧，声音颤抖着，“诸位，请回。”\n杜巽按捺不住心中怒火，又大喝一声，高抬刀锋，策马而前冲向夐亿，史乾见状也拨马上前为杜巽助阵。\n夐亿倒吸一口气，打也不是，不打更不是，他想着，手里也不禁催起马来，“得罪了。“说罢闪身躲过杜巽一劈，刚回头欲挑其手中长刀，不想史乾也提大刀来砍，便将枪尾挑偏刀锋，回身挥枪将史乾打下马，待杜巽回转，夐亿又舞起枪尖压向杜巽，两人兵器相撞不过三声，杜巽便自知已处下风，欲卖一破绽引夐亿调转枪头，夐亿便抢先一步刺中杜巽头盔，将盔挑飞落地。\n夐亿将枪尖压住杜巽刀尖，“诸位请回。”\n不日，先帝旧部六将中剩下三将亦率亲兵而至，听夐亿言前三将已回，遂修书一封命秘使送往轩辕公处，悻悻调转队伍回营去了。\n轩辕衍将书信摊开在案上，示意帐下诸将上前浏览。\n待诸将后退，他大喝一声，“就是孤立无援，我等也能大破敌军，我一生百战，以少胜多之役，又未曾没有打过，不过是重操旧业罢了，“轩辕衍一拳砸在信上，“来人，取囊关图来！”\n未几，囊关地势图铺展帐中，众轩辕家将两列排开，轩辕衍用手指画着地图说道，“囊关山高地险，蛮夷驻军低地，显然不懂用兵，纵使彼方势众，胜负仍未可知。我安插在叛军中的细作发来书信称，蛮夷分四寨驻兵，西寨离关最远，是叛军所在，南寨守军薄弱，离北方主寨最远，我等就以此二寨为目标。”\n“需儿，你不必涉险，领三千步卒佯攻东寨，记住，要装作声势浩大，引敌军兵马出寨，为我等突袭争取时间，若敌主力来攻，你可回关拒守，点火为号。”\n“从。”\n“王断，你最利冲阵，随我领两千轻骑去取南寨，速战速决，仰仗你了。“王断，轩辕衍帐下先锋，曾率八百先锋骑兵先登，冲散一万众敌阵。\n“从。”\n“贤弟，你素擅奔袭，望你领一千骑兵先行一步赶往西寨，待南寨火起，来我等合兵一处。”\n“从。”\n“有义，你守城有方，剩下军队凭你调遣，若有必要，可出城援助岁需。“吕有义，主管运粮，曾率数千残兵于孤城中抵御数万敌军数月攻势。\n“从。”\n“其余诸将……”\n待众将退去后，轩辕衍上下打点一番，仍觉兵力甚少，扼腕而叹，“倘是先帝尚在，必不会置我轩辕氏于此等险境罢……”\n“王朝半壁江山皆是我等轩辕氏打下的，衍兄莫还不明白，这是圣上要除却我等善战之功臣呐。“轩辕闵来拜别其兄，恰闻此话，便不禁直言。\n“休要胡言，除却我等与旧部六将，朝中又岂有能挂帅之人，这点，不仅圣上了然，就是司马氏也心知肚明，自断一臂，司马氏也不会由着圣上这样做的。”\n“衍兄虽向来与司马氏交好，但司马氏毕竟不是我等亲族，恐有掘起我等朝中势力，独揽大权之嫌呐。”\n“贤弟不必多言，朝中形式我自有推断……“轩辕衍将手下摆，示意轩辕闵不要再说。\n“罢罢罢，衍兄，我去也。“轩辕闵拱手作揖，跨剑出帐。"},"title":"（一）·《王朝轩辕衍公世家（一）》"},"/dae/century1normal/passage2/":{"data":{"":"欧荣·海德，乂字远征军荣誉大统领，帝国最高议会议员，第二大帝奥尔科托·尔白义兄，尝孤身鏖战祸兽圳，斩其首级，帝国上下无可与其角力者，第一大帝纽万·尔白远征时为其帐下第一骑士，因屡破敌精锐而颇受大帝赏识，第一大帝赐其圣殿座次，授帝国最高荣誉十字剑章，领圣器长矛铓，权及大帝之下第二，仅次于议会长冯·文森特。\n此刻，他正按下辔来远眺西营南营冲天的火光，“传我令，北营兵马不准出击，东营若受挑衅可出佯攻之兵，若抵敌方营垒，立刻回还，不可恋战。”\n“父亲，我不理解，明明我等可以率我北营精锐冲杀出去断其后路，全歼这些异教徒，可为何要损兵折将，还放虎归山呢。“海文·海德，欧荣之子，此时手里正紧紧攥着大帝所赐之十字剑。\n“海文呐，你当然不理解，毕竟你还没想清楚我们都在干什么，只能看到我们营垒中窜起的火苗，“欧荣催马向前一步，指着西营看向海文，“那儿，异教徒叛军，他们对这片故土的热爱恐怕不能让他们全心全意倒向我们——毕竟我们在他们眼中也是异教徒，我怕西营大多是异教徒的内奸，于是放任他们自相残杀，就是西营倒戈相向也没有关系，毕竟这些军队本就不属于我等，我等还顺便铲除后患，“说罢，再指向南营，“教会与议会本就水火不容，故而五千教会军均驻扎在离我等最远的南营，倘若这些异教徒能全歼教会军，或者重创教会军威风，再待到我等大破异教徒之时，教会之功，便自然在议会前低下一等了。”\n“再说这些异教徒，此次贸然出击直奔我等兵力最薄弱的两营，估计是想确保首战告捷以振奋士气，从而告诉他们的首领他们能消灭我们，那么此战之后，恐怕这些异教徒就会倾巢而出，来收复我们身后的那座大城市——或者叫这些异教徒的主巢穴，故而此役之胜负，就在接下来的一仗了。”\n“海文，你是否疑惑，此处易攻难守，不是扎营好去处，为何我要选择驻扎在此——地势低洼之处。”\n“父亲，我知道此题有标准答案，你不妨直说吧。”\n“接下来，我等需尽数后撤，告诉这些异教徒：‘我们怕了，我们是鼠辈，赶快来收复你们的巢穴吧’，让他们以此地营寨为跳板，来攻主巢，届时就是他们修筑了营寨，也不能修正地形，我们只需率精锐一举歼之主力，这块异教之地，便可被净化了。”\n海文听罢若有所思。\n长篇大论说完，欧荣拔剑出鞘，将月亮颉至剑尖，“此地之月，竟与帝国之月并无两样，海文呐，你说，这里是否本就是古帝国疆域之内，大帝统一的帝国，是否只是古帝国的一角呢。”\n“普天之下只有一个帝国，一个信仰，大帝之帝国将泽被万代，更盛于古帝国。“这次，海文没有思考便可脱口而出。\n“海文呐，你又答非所问了，我在想，倘若此地之大堪比帝国，那待我等净化此地，岂不是创第一大帝之伟业了。”\n欧荣军才退至半路，便有几个副官来告急，“后方来报，有浓烟四起，怕是异教徒已经追来了。”\n“唉唉，我等陷阱埋伏还没设好呐，这些异教徒还是没有一颗宁静的心啊。“欧荣拔剑高举，部队中的吵闹声便渐渐少了，直到只听得见板甲与十字剑晃荡的声音。\n“步兵射手就地寻找掩护，骑士老爷们随我诱敌深入！”\n“呼啊——“骑士们调转马头，抽出背上的大剑，振臂高呼。\n“父亲，我看这烟尘并不浩大，估计这些只是敌军先锋，我们是不是该等敌军主力出击，再动埋伏。”\n“此言差矣，海文，这些异教徒可是抢着要拿我等的头颅换功呐，哪里会想分批进攻，恐怕这就是异教徒的指挥领着他的一批亲信精锐来夺首功的，“欧荣放下剑，点点海文，“诈败的活恐怕你还没做过，这次你且随我来，以后就是你接我令自己诈败了。”\n海文的马下，已倒了两位王朝的勇将，他一手握剑，一手持矛，两器相撞迸出火花来，“哈哈，异教已无善战之徒了吗。“他一边喊道，一边心里想，陷阱伏兵什么的，或许挺多余的。\n“这小子年纪不大，招式却是不少，我观他两次单挑，均是三招之内出胜负，五招之内定生死，不容小觑啊。“轩辕衍回头扫视诸将，“可惜我已年老，倘是十年之前，我定亲自破他的这些花架子。”\n“衍兄，让我来会会他。“轩辕闵向后方招呼，几个小卒将他的大刀抬了上来。\n“贤弟不可，你力气虽大，却在他这些化力的招式面前讨不到便宜，“说罢，轩辕衍摆摆手，“王断，你去罢。”\n“从！“话音未落，王断便一马窜出老远，挺枪直刺海文面门。\n海文见王断如箭一般射来，不禁浑身一颤，急忙挽矛勉强拨开枪头，来不及挥剑反击，便又被他枪尾狠拍一下，幸得紧夹住马后退几步才缓过身来。\n冲罢一波，王断迅速调转马头，再度舞枪来会海文，海文先前从未见过如此阵仗，手上章法便混乱起来，也恐是与先前两将角力过度，体力也逐渐不支，被王断逼落下风。\n“想不到这些异教徒还有些苟延残喘的资本，“欧荣抬起一只手示意，“吹号角撤退，诱他们去踩陷阱。”\n可是海文鏖战正酣，哪里顾得上撤退，号角声逐渐沦为兵器碰撞声的背景板，王断见海文招式已乱，便不遗余力地攻向海文，海文在防守的空隙讨到一丝破绽，于是断然挥剑，将王断砍翻下马。\n“这小子，倒是打得倔强。“欧荣将手摆摆，示意停下号角。\n“这些蛮夷也是威风起来了，倒吹起号来壮声势，来人擂鼓！“轩辕闵不顾衍公言语，单手提刀便向海文掩杀而去。\n“这些异教尽会使些外招，这鼓怕是来吵人心智的。“海文听到鼓起，知晓又有将来单挑了，便抛下王断来会轩辕闵。\n鼓过半晌，海文虽是力气使尽，却也愈战愈勇，两将依旧不分高下。\n“倒是给他打了个爽快，要不是我等一定要败下这场，我也想来舒舒筋骨，“欧荣向着其他骑士玩笑道，“好了，吹号角，别让伏兵等急了。”\n号角再起，海文才想起自己有诈败的任务，便轻叹一声，卖了轩辕闵一个破绽，让他来缴自己的兵器，轩辕闵酣战已久，便不假思索去挑他破绽，海文见状将剑一抛，故作慌忙掣马逃离。\n“懦夫，你非得吃我一刀，好让我给王将军报仇！“轩辕闵想着，便赶马去追。\n“蛮夷此行皆是骑兵，就是对将不利，也该冲杀一阵再跑，这才算是用上了骑兵的优势，怎么如此一触即溃了呢。“轩辕衍叫闵侯亲骑先行一步支援轩辕闵，回过身来对诸将说。\n“我看这个小贼不是好欺负的玩意，闵侯能胜，恐是有些蹊跷。“王断捂着伤口被兵卒抬了下来。\n“衍公若是有顾虑，便给我一支小队，我会在后方观察敌军动向，若有疑兵，便火速来援。“吕有义向前，往轩辕衍拱拱手。\n“如此甚好。”\n“父亲，你不是说蛮夷不懂用兵吗，许是他们不知道怎么用骑兵呐。“轩辕岁需过来插一嘴。\n“多考虑些，总是好事。余下各部，随我追击。”\n“父亲，身后伏兵似是已经冲出来了，我等还不回头吗。”\n“不必回头，这些小股部队就交由伏兵，我等在前方等待，若敌军有接应，我等再冲不迟。”\n不时，衍公果然领兵来救轩辕闵，欧荣见状对着海文大嘘一声，也领骑兵冲杀下来。\n“斩敌将者，侯！“轩辕衍大喊一声。\n正是这声喊，让欧荣注意到了轩辕衍，“年老为将，必是匪首”，乱战中，欧荣顾不得分析局势，策马提矛直刺向轩辕衍。轩辕衍见状挥起刀风，却或因年老体衰，被欧荣破开风来，刺中数枪，忙呼人来救。\n轩辕闵与海文鏖战正酣，听得衍公疾呼，也不迟疑，即刻放下海文去救衍公。附近轩辕岁需刚冲出伏兵包围，见衍公不敌欧荣，也果断叫上三五亲骑再冲回包围。\n一时间三方兵器来抵欧荣，欧荣也不落下风，挽矛策马于三人犄角之中穿梭，教三位轩辕没法同时与其交械。\n交战不久，吕有义援兵来救，见三轩辕在欧荣身上占不到便宜，匆忙拉弓飞起一箭，险些射中欧荣座下之马，欧荣马惊，向后连退几步，三轩辕趁机一拥而上，才勉强将欧荣打退。\n轩辕衍见兵甲损失惨重，便也不再恋战，教援兵掩护大部队向囊关回退。\n战后欧荣夺回前线营寨，着手打扫战场，发觉王朝部队损兵甚多，教会部队亦损失惨重，不禁向肯威甩下几个眼色，肯威气不过欧荣，便找了个借口领教会残兵回帝国去了。"},"title":"（二）·《东帝国：乂字军欧荣·海德生平（一）》"},"/dae/century1normal/passage3/":{"data":{"":"司马相宜，初为尔郡本地势力掌事，在先帝军至尔郡时受先帝感化转而效忠子氏，率军民投奔，后又与子氏联姻，主掌先帝治下各地政务，作为两朝宰相，全王朝的派系谏言弹劾，人才登庸提拔，政策经济改革，子刹也都是托他来管。\n“陛下，前线衍公再次告急了，“司马相宜双手捧着战报，向着子刹穷追不舍，“就是要收夺兵权，死去的将士也是无辜的啊。”\n子刹依旧在殿上踱步，低头沉思，似是不想理会前线战事。\n“圣上。“夐亿跨着剑，走上殿来。\n“夐都督终于来了，“子刹抬起头，舒展眉头，“先帝六部可愿交出兵权？”\n“六位将军似是早有互通，一致要援助衍公之后，再将本部兵马交出。”\n听罢，子刹大嘘一声，上殿坐下龙椅，“司马爱卿，你作为宰相许是能言善辩，可否劳烦与夐都督同行，从六位将军手中收回兵权。”\n司马相宜仰望龙椅上的子刹，知晓他是非要兵权不可，暗暗叹了口气，“陛下，国家命脉在于人心而非政治，得人心者必王之，国家强大在于文化而非兵甲，文化盛则国不灭，望陛下…”\n“爱卿，“子刹顿了顿，指向夐亿，“兵者国之大事，各地军队只知将军而不知有都督，各地将军只知郡守而不知有天子，都跟着认识的头领走，而不管虎符在谁的手上，号令由谁发出——这哪里是我王朝的军队啊，这根本就是土匪流寇，倘若外邦侵犯我朝疆土，难道倚靠这些散兵游勇保家卫国吗…”\n“…“夐亿拱拱手，先行从殿上退下。\n车途颠簸，两人向来少有谋面，车上一时安静非常。\n“夐都督年少有为，可惜啊。“司马相宜故意将\"喜\"说成\"惜\"音。\n“才疏学浅，不敢以’有为’称也。” “可曾与轩辕公谈论过兵事？”\n“不曾有过。”\n“可我从轩辕公处听闻，先帝在时，你曾与之论辩，莫非为假。”\n夐亿先是低头若有所思，后又猝然抬头，“确有此事，当年吾年方十余岁，正与圣上论剑，将败之际，轩辕公来问吾衍子兵法十四章，吾便背过去了，罢了要与吾演兵，当时吾只知有兵而不知有将，私以为兵卒皆如圣上般勇武非常，便亲领中军横冲直撞，大肆破坏衍公阵法，屡试不爽。”\n司马相宜听罢，只得苦笑附和。\n又行了一段路程，车马从大道逐渐走上了乡间土路。\n正当司马相宜想再问些的时候，刹那间林中憩鸟惊飞，夐亿心中一紧，发觉异常，迅速挟着司马相宜伏下身去，此时几根冷箭穿车而过，直直射下相宜头冠。\n“保护…“车外士兵还未说完，便在乱箭中倒下马来。\n夐亿抓起司马相宜蹿出马车，提枪上马，林中喊杀声四起，三两拨头上绑着黄巾带，腰上别着杀猪刀的土匪从林子里冲出来，夐亿挑翻了跑在前面的几个，余下的便将夐亿和司马相宜里外两圈围住。里圈的人看着夐亿不好对付，想向后退，外圈的人看着夐亿人少，想一拥而上把他乱刀砍死。两圈人你来我往地卡住，让夐亿看准了两拨人挤开的口子，趁势冲了出去，身后的土匪你推我搡地互相骂了许久。\n“此地竟有如此匪患，宰相，你可知情？”\n“此地从未有关于匪患的消息传到朝中，莫非是落草不久的流寇？“司马相宜虽刚死里逃生，却也很快冷静下来。\n“此事确有蹊跷，可吾等有圣上之命在身，收兵权之事不可耽搁，该往何处去。”\n“我知道附近有几处村庄，不妨先去休整，都督且走此道…”\n“店家，这附近的土匪，是怎么回事。“刚到一处客栈，司马相宜便逮着老板问这问那。\n“土匪就是土匪呗，有啥么子稀奇的，这一带的土匪成片成片地给这块地方占满了，在这里成年的汉子看着哪边的头头名声势力大，就往那边投去，倘是没有力气有点脑子的，就像我们这样做些小本生意，平时给各个头头一点平安钱就够了。”\n“难道官家不管的么！”\n“官家是哪家，这片的头头没有姓官的。”\n司马相宜气不打一处来，暗暗骂了一句自己，转头愤愤地对夐亿说，“都督，我非得去郡城一趟，民生之事乃国之根本，匪患寇灾堪称之蚁穴，都督可先行去找先帝六部，我处理完此事随后便到。”\n“既然如此，那吾先护送您到郡城，再走不迟。”\n“店家，这里的土匪，有几年了？”\n“打我出生时便有两三股土匪在这里扎窝，后来听客人说有个大大王一一地把这些大王给收拾了个遍，但是没把他们全杀了，反而是让他们来保护这一方平安，要我说，这个大大王就是有膀子没脑子！再后来大家都开始当大王了，这些大王都只知道老大王，不知道有大大王，每过个几年，大大王过来’体恤民情’，都得和这些新大王打一架，再让他们上些贡，然后承认这些大王的地盘，唉唉…”\n“店家，这大大王是从哪来的。”\n“那边，大概是那边吧，每个客人指的都歪七扭八的，大概就是那边了。“店家捋了捋胡子，指向郡城的方向。\n“那这附近难道就没有人不想交这平安费，而想去打这些大王的呢。”\n“有哇，多了，不过这些人后来也当大王了。”\n“卑职不知宰相都督大驾，有失远迎，还望见谅。“郡守安尧领着一群操着棍棒的家仆站在府前，将司马相宜迎下马。\n“吾先行一步，告辞。“夐亿无心此事，便匆匆策马离去。\n“宰相为何与都督骑马来到，而不是乘马车或是轿子 ，这一路颠簸可是受苦哇。”\n“尧君，有人在路上故意撒些石子，教我一行人仰马翻，你可知情？”\n“宰相说笑了，哪有石子绊得了车轮呐。”\n“你领上一队人马，随我去绊车的地方看看，便知这石头的厉害了。”\n“不和宰相打趣了，卑职晓得宰相是来问罪的，但卑职手头上的确没有什么人马了，卑职能做的，也只有领着我府上所有的家仆，也就是这些，约莫二三十人，“安尧将手摆向身后，“去和那些土匪死战了。”\n“怎么？你堂堂一个郡守，郡内的兵力调不动么！”\n“哪有那么简单，自先帝分兵予将军以来，从来都是我们郡守向将军要兵，若是将军觉得能从中吃到好处，便以治民为名将土匪扫荡一遍，向他们讨要军费，若是土匪势力不大，他们便不予理睬，待将土匪养肥了，便去割上一道，“安尧深叹一口气，“军队只认将军，便是如此。”\n“此郡掌兵的将军在哪？”\n“在城外不远处，卑职可即刻为您先行引路…”\n军政两边对质许久，但依旧没人出军营半步，“宰相所言及是，可军队也有军队的难处，自先帝分财政予郡守以来，军队的收入竟主要倚靠屯田，哪有军队同时常备刀和锄头的道理！那军队要扩军的军费，就只能从剿匪这个途径来，但一个郡也就那么些地方，这边剿完那边剿完便没有钱来了，为了兼顾安民和军队开支，只得出此下策，也勉强能算两得。”\n“荒唐…真荒唐…“司马相宜气不打一处来，“此事我定会禀明圣上，不日便会改此旧制，还望将军先去剿匪，还百姓一片平安。”\n“一日不改制，军队便一日难以有粮，宰相，恕末将为军中的弟兄们着想，不能遵命。”\n“军管军，政管政，这样分工说到底，根本不算组织。“看到一时之间难出结果，安尧手下两三人将司马相宜拖回了州府。\n“待我回朝非得砍了这些没有大局的人不可。”\n“如今军队上下就是这种运作方式，砍了一个土匪将军，还会有下一个接替他的位置的，上行下效，自然如此。”\n过了约莫两三天的论战，司马相宜这边显然更胜一筹，但奈何军权始终在将军手上，将军不退步，军队便始终没法作为。\n不得已，司马相宜只得修书一封送往夐亿处，不过这次，夐亿先一步于回信来了，还带来了先帝六部的先锋军三万。"},"title":"（三）·《王朝司马相宜公世家（一）》"},"/dae/century1normal/passage4/":{"data":{"":"夜袭已过去多日，王朝军队进不得退不得，轩辕公伤势也日益不见转好，时间已经不站在他们这边了：再次放手一搏功于一役，或是全军后撤回都养伤，这是他们最后的选择机会。\n“死在战场上是每个将军的愿望。“轩辕衍听到岁需后撤的建议，摆摆手说道。\n“衍公，我听闻那夐都督已经将先帝六部收归麾下，却迟迟不引兵来救，恐怕朝中已无人希望我等战胜蛮夷了。“闵侯坐在一边翻着朝中传来的书信，又将它们一张张火化。\n“轩辕家世代忠良，为何会有如此下场。”\n“今时不同往日，先帝在时军队甚少，各部可以自给自足，自然就让军队自己打仗，但现在王朝已立，军权却仍在将军手上而不在圣上手上，政治没有了军队做保障，便没有了权威，除却我等旧部，便是情理之中，不援只是借刀杀人，即使没有夷人来犯，我等也难以保全。”\n“荒唐，收归兵权之事当在和平之时，哪有临阵夺帅这种事。“轩辕衍气不打一处来，“不必再揣测意图了，当务之急是以我朝为重，将这些蛮夷打退，兴复旧都…”\n“兄长，朝中要来旨了。“闵侯又翻开一封书信。\n“对我们这里还能有什么旨意。”\n“圣上决定将囊关献出，与东帝国作一笔交易。”\n“什么东帝国？要拿囊关换什么？”\n“圣上已经承认这些蛮夷所建之国，他们的国家叫做帝国，王朝在他们的东边，他们便将他们占领的土地称为东帝国，至于要拿囊关交易什么，呵呵，圣上要拿都城的门户换他后宫的门户。”\n轩辕衍听罢猛然挺起，抓过书信浏览几遍，随即胸中气血上涌，一口吐在信上。\n殿下终于没有司马相宜与他斗嘴了，子刹坐在殿上，一时竟不知道要看哪里，要做什么。\n“圣上，东帝国那边回信，表示很乐意让圣上尝尝新鲜的，也很乐意帮我们管理囊关大小事物。“司马相宜不在，宦官平仪才敢走上殿来。\n“此事全权交由你手，记得要多备点东西，我想轩辕公是不会那么容易放开囊关的，到时候还需你去赔礼道歉。”\n“自然自然，承蒙圣上厚爱。“平仪堆着笑退下殿去了。\n“夐都督那边如何？“子刹瞥向周围。\n“已将先帝六部的先锋军三万带来了，驻扎在前府郡，郡守安尧已将宰相留住了，剩下的六部主军会逐步赶来。“说着递上一封信来，“这是安郡守的密信。”\n“你拿去看吧，他说话老是打马虎眼，说不到重点，你去总结一遍，再给我看。”\n“从。”\n“海文，你觉得这次交易，是真是假。“欧荣一只手压着平仪的密信，一只手捏着王朝的回信，递向海文。\n海文接过回信，撇撇嘴，皱皱眉，“当然是假的，这些异教徒就是再蠢，也不会蠢到拿土地换女人的程度，恐怕这是要让我们领兵进驻囊关之后，在关内设伏，将我们包圆了。”\n“半对半错，对在设伏，错在献关。哈哈，海文呐，你还是没有清楚这场战争双方要什么。“欧荣拍了拍海文，又将密信拿起来晃晃，“我想那异教徒必然实力雄厚，不然不会拿家门开玩笑，丢一块土地在他们眼里算不得什么，倒是与我们交锋的这个人有些意思，一介老将能有如此地位而不退居二线，身上必然是有赫赫战功的，然而有如此战功者统兵却不多，对面怕是要借刀杀人，那么我们接下来就会迎接这位老将最后的反扑。海文呐，战争可不只和敌人拼刀剑那么简单，就像我们要打压教会军一样，有时战争更多是和自己人打架。”\n“那现在应当如何，不接这囊关吗？”\n“当然要接，不用攻城就能拿下的关隘说什么也不能随便丢掉，不过一场恶战而已，海文，我们就这样大摇大摆地进去，然后送这位可敬的老将上天堂吧。”\n囊关的城门在十几天之后又一次打开了，上次是轩辕衍败退，这次是欧荣入关。\n老将此时已经失去了他仅有的优势——老练，稳重，从他身后传来的诏令比从身前飞来的冷箭更加致命——他也知道，他们都知道，已无人期待他们凯旋。\n战鼓隆隆地响了，要激起王朝将士最后的热血，号角呜呜地咽着，是帝国骑士赠与他们的默哀。\n轩辕衍挟着长刀在乱战中穿梭着，身后跟着王断和吕有义，他在找欧荣——他知道，只要擒贼擒王，这场死战或许还有转机。\n他们没有花太多功夫，因为欧荣总是冲在他的近卫队前面。\n“王朝永存——“轩辕衍高呼一声，纵马冲出人群，长刀于空中划出一轮半月，结实地砍向了欧荣的右臂，顷刻间，朵朵血花绽开在骑士的板甲上，将众人的惊诧掩住。\n欧荣于剧痛蔓延全身之前凭着意志左手拔剑出鞘，堪堪挡住轩辕衍趁势挥出的余下几刀，且战且退，后方海文赶忙来接，这边王断吕有义一拥而上，海文将三人架住，将欧荣掩了下来。\n欧荣退却之后，轩辕等人以为帝国军大势已去，刚想松一口气，又看到海文两眼瞪圆，双手震颤，高吼一声向他们冲来。\n王断急挟马挥刀来挡，海文此时正怒火中烧，只几矛便将王断挑翻，吕有义在远处捻弓放出冷箭，海文顾不得抵挡，身中数箭，却也被怒火拉扯着去取有义，一剑砍断了他的长弓。\n轩辕衍自知阎罗已至，也不想退缩，横刀立马站在高处俯视乱军中的海文，他取下头盔，任凭满头白丝染上夕阳，“泛泛蛮夷，岂能撼我朗朗王朝，即使我等今日战败，他日也定会…“话未说完，轩辕衍便被海文一矛挑起，矛头微微扬起，血夹杂着汗顺着矛身的纹路爬下，淌满了海文的盔甲。\n喻史官后书：轩辕衍公既殁，王朝举国悲痛，刹帝追封其为开国公，轩辕闵侯不幸被阵斩，追封为开国侯，轩辕岁需于乱军中杀出得以回朝，自愿为衍公守孝多年，从此不入王朝朝堂，轩辕家至此销声匿迹。\n轶史官传闻：轩辕闵侯于囊关决战前暗率亲军离关，据说后来更名改姓落草为寇，世人不知其所踪，轩辕岁需率残兵回朝后被带着子刹密令的亲卫软禁，为的是防止他接替衍公之位重夺兵权，后来侥幸逃脱，也自此销声匿迹。"},"title":"（四）·《王朝轩辕衍公世家（二）》"},"/dae/century1normal/passage5/":{"data":{"":"大门吱嘎一声被守卫推开，他穿过无人的礼拜堂，走进回廊，一间间房间找着。\n挂壁上的蜡烛暗暗地发着光，角落的蜘蛛吊在交错的网上，升起，又落下，自讨没趣地修复着这张历史悠长的破网，回廊里弥漫着潮气，夹杂着腐烂食物的味道，好在这些气味被圣水盖着，倒也并不难以忍受，不过低矮的廊顶仍让他感到些许压抑，想早些离开这里。\n“终于找到了——“多年征战在外没回教堂，他对此地甚至有些陌生了。\n肯威·康奈特推开了忏悔室的门，将佩剑解下交给一旁的信徒，双膝跪地双手合十，开始默默地低语。\n不知过了多久，教堂的钟约莫敲了两三遍，忏悔室又走进来两个人，“好久不见，兄弟，怎么一回来就忏悔，为什么不把你的’过错’跟你的兄弟们说说呢，“达尔·康奈特，肯威之兄，议会骑士团长之一。\n“教会与乂字军应当齐心协力净化异教徒的，为什么欧荣统领在我们被袭击时没有出兵援助！哦不不对，这里面也有我的过错，或许是我没有及时通知欧荣统领，又或者是我的实力不足，没能击退这些野蛮的异教徒…不不对…”\n“你有些神经质了，兄弟，乂字军和教会作对不是一天两天了，我正要请命带人去监视欧荣呢，哈哈，他自立的消息就紧跟着你来到纳铎了。”\n“你说什么？！”\n“东帝国，倒是一个好名字，既能告诉帝国的老家伙们我们依旧是帝国人，又能让我与大帝媲美。“欧荣此刻正端坐在中陵的龙椅上，在约莫一个月之前，这里坐着的还是王朝的殇皇帝。\n威廉·兰斯按着双剑在殿里上下打点，给大殿多添了些王朝的气息。\n“将军，你们的国家，叫什么名字。“海文也在殿里打点，把一些王朝的东西换成了帝国的。\n“我们的国家，叫作王朝。”\n海文思索了一会，将架子上的一个花瓶换成了圣水瓶，背对着威廉说道，“恕我直言，真是个蹩脚的名字，莫非意思是让你们的王去四处朝见吗，怪不得你们的王如此卑微，像我们’帝国’意思就明确了，大帝的国家。”\n“理解反了，外邦人，王朝讲究以威服，要四海八荒之内的万邦来朝见我王，故而称为王朝。”\n“原来你们天天喜欢反着说话吗…”\n话未说完，又被威廉打断，“我们只是给说话增添了些王朝的艺术，不像你们的语言那样干瘪，难道你们的王也向来说白话吗。”\n海文压住了自己的脾气，不得不换一种眼光看这位王朝降将。\n“我儿，我翻看这些老古董书的时候看到王朝的皇帝有打猎的传统，什么时候我们也去试试。“欧荣晃着空荡荡的袖口，歪歪扭扭走下龙椅。\n“父亲，哪怕我们已经重创了王朝军队，我想现在也不应该是放松的时候，王朝随时有可能重新集结大军，如此庞大的国家不会因为一次战役就失去反击的能力。“海文先前受震撼于王朝宫殿的里里外外，对这个被他们称作\"异教\"的国家高看起来。\n“儿啊，看一个国家强大与否不能只看他的兵甲战车，这个’王朝’，他书里的种种制度无不告诉我——皇帝没有权力集结部队——真可笑，把兵权政权分给了他手下的那么多人，谁能保证这些人都全心全意为着国家，又有谁能保证这些人聚在一起能让令行禁止，不能，完全不能，现在他们的国家已如风中残烛，因为他们有再雄厚的实力也没有办法聚集在一起，我想，只有’大帝’可以拯救他们，但是他们这样的文化可容不得’大帝’。”\n威廉听到后面默默点点头，想反驳些什么，但始终没有开口。\n议会厅吊顶灯的蜡烛已经点满了十二支，入座的却只有十一个人。\n“大帝的帝国仍然繁荣昌盛，“冯·文森特依旧在复述他的那些客套话，“我们的公民依旧遵纪守法…”\n“但在帝国的一角——准确来说是帝国的东边，海德的欧荣，我们尊敬且光荣的乂字军荣誉大统领，在征服了一群打着’王朝’旗号的异教徒后，想在帝国的东边建立一个直属于他的根据地——或者说是地方组织，甚至说是国家。对此，我想知道列位大公们，怎么看…”\n“在这件事上，我想没有人比大帝和您更有发言权了。“烛火照不到的阴影中，一位议员不带好气地说道。\n“理查德的休伦，您总是把话题转移到一个没法解决问题的区域，我想我们都不是来这里聊闲天的。“冯敲了敲桌子，顺带着把桌子另一头一位快睡着的议员敲醒了，“还有您，理查德的拜姆，我知道您公务繁忙，但也请您重视帝国最高议会。”\n圆桌的某一边传来了几声窃笑。\n“我想我们应该承认欧荣统领的功绩，那片蒙昧的土地，理当赐予他执掌，至于当地的异教徒，应当感念大帝的恩泽，每月将当地最珍贵的物产上供作为献礼，由欧荣统领亲自送达，大公们意下如何？”\n一片鸦雀无声，或者说，只能听到回荡的几声窃笑。\n“既然大家没有意见，那我会后向大帝禀明意见，接下来我们讨论下一个议题…”\n窃笑悠悠地传出议会厅，飘散到纳铎的大街小巷里，最终钻进了大帝的耳中。"},"title":"（五）·《东帝国：乂字军欧荣·海德生平（二）》"},"/dae/xu/":{"data":{"":"——高三晚自习，某欲为歪曲历史之长文《王朝与帝国》作序，提笔却久不能落，不知何序可应“歪曲历史”之题，惊觉十八层地狱或由人尸筑成，历史有如长城之伟绩，长平之军功亦然，故作无病呻吟之咏叹，以长文中意象“高台”作比，断章取义，付诸笔墨。\n历史不会倒退，时间不会停滞，王朝与帝国的往事不会被风沙抹去，不会因血流平静。\n生死云云，不过勉强之辞，人生而后死，何来存亡一说？握着江山的，是君王而不是人民，记述历史的，是学家却不是历者。生是一个人的，死便是一堆土，壮士与黄土，有其么区别，有甚么联系？\n好的，成了黄纸上的一片污绩1，坏的，就埋到土里去喽！\n又有说啊，这九层之台，始于累土，没有土，哪来的台，台子是在土上建的，人是在台子下死的。究竟是土，哪有土翻到台子上的道理！台上的土会被良禽2狠狠地啄去，台子下的土，会被一层层埋上，永远翻不起来。\n书是人写的，却不写人，台子是人建的，却站不得人，这有甚么意思！可是土就是土， 土不会土出话来，更不会在台子上排出字来，过路的闲客在台子旁道一声漂亮，或趴着歇会，道一声舒坦，有土甚么事，都压在台子下了！\n无土哪有台，无下何来陛，历史会被尘封但不会消逝，时间会迟到但不会缺席。王朝会颠覆，帝国会破败，土却依旧在台子下，记着台子的历史。\n污绩：有些敢于反抗的人会推翻旧王朝旧帝国，但在下一任人推翻他们的政权之后，前者的丰功伟绩便变成了污绩——为了诋毁前朝并赞美今朝，或者说，假如这些义士没有成功推翻旧政权，那么他们就会被冠以反贼之名，也是历史上的污绩 ↩︎\n良禽：“良禽择木而栖”，此处代指忠臣，表示皇帝身边的\"忠臣\"会为皇帝铲除这些反动势力 ↩︎"},"title":"序：台土"},"/essay/":{"data":{"":"随便写写~\n想起来就写~~\n也有可能想起来没时间写~~~"},"title":"随笔"},"/essay/the_legend_of_the_white_eye_wolf/":{"data":{"":"猎人早就知道它是狼了。\n但它不知道。\n“砰——”\n它听得出来，猎人这一枪命中了。猎人给它训练出的本能驱使它撒腿狂奔，子弹命中处涌出的血指引它找到了那头不幸的鹿。\n它扑了上去，撕扯下一大块肉来。\n“畜牲，别吃生肉！”猎人哼哧哼哧地追过来，抄起枪托砸它的头。\n他怕，这几年来他一直把它当成狗来养，不让他吃生肉，生怕它想起自己是头狼来，他知道，狼是不亲人的，说不定那天他就会在熟睡的时候被这它像这样咬下一大块肉来。\n但他得养他，市面上给猎人用的狗都太不实用了，这头狼或多或少能弥补他找不到合适的猎狗的难处，而且这家伙能胜任猎狗的职位，还能做的相当出色。\n但这几次狩猎，不论他怎么用枪托砸它的头，它还是会吃下几块生肉，他知道，它越来越渴望吃生肉了。\n越来越像头狼了。\n他得除掉它，就在今晚。\n当猎人拿着上膛的枪蹑手蹑脚走到狗舍（或者应该叫狼舍？）前时，它醒了，但它闻的出是猎人，它没有在意许多，作为一条狗，它理所应当地起身去迎接这位衣食父母。\n迎接它的是阴森森的枪口。\n它愣在那，这把枪它知道，每次见到猎人把这枪端起来瞄准时，它就得做好冲刺的准备，猎人把这叫做“狩猎”，但这次，往日指向它要追的猎物的方向的东西这次指向了它，难道这次狩猎，枪响之后，它要撕扯自己了？\n猎人这时也愣在原地，他不知道这头狼还觉得自己是狗，还会出来迎接他这位“主人”，但不管它把尾巴摇得多么热烈，他都得除掉它，为了今后一个时刻存在的——或许是不存在的——“隐患”。\n枪响了，但没有打中它的脑子，因为猎人愣的那一下，枪口也随着他的身体微微颤抖了一下，子弹带走了它的一只眼睛。\n猎人的身影在它眼中染上了一层血红。\n枪声在静夜中隆隆作响，这是猎人给它送别的礼炮，它多带走了猎人几颗子弹，在血红的山林中落荒而逃。\n“这畜牲吃了这么多子弹，又瞎了一只眼，想必也活不久。”猎人这样想，嘟囔着收了枪，又把那座简陋的狗舍拆了，拿来当明天的柴火烧。\n事实也确实如猎人所想，它没在林子里跑多久，便栽在了草地上，渗出的血在身下一片绿草中开出了一朵红莲。\n假如后来狼群没有闻到血味找到他们想象中的这头“猎物”，或许它会死于失血，哪怕不是这样，林子里也会有其他掠食动物来认领这顿美餐。\n“它是猎人养的那头狼！”\n“不能留他，狼群也曾养育过它，但它却反过来帮猎人猎杀狼群，白眼狼！”\n狼王还是决定留下了它，毕竟它还是一头狼，是狼就是狼群的一份子，作为狼王它深谙这点，它靠着自己作为老狼王的威望把它留了下来。\n在狼群里它恢复的很快，它的那只眼睛也从红色慢慢转白——它成了名副其实的白眼狼。\n刚进入狼群时，它还不能参与到狩猎中，它太虚弱了，跑起几步就得被体内的子弹拽回到地上，于是它成了狼群里的累赘——狼群显然不欢迎只进不出的家伙，他们纷纷叹息于老狼王的糊涂，也愤恨于这位白眼狼同胞过去给猎人当走狗的种种。\n狼群在一次狩猎中抢走了鬣狗的大餐，这次“抢劫”活动中参与抢劫的狼群成员都饱餐了一顿，又在回来后招呼着这位白眼狼同胞去享受或许已经开始腐烂的“大餐”。\n果不其然，现在这顿大餐是乌鸦在享用，白眼狼还是决定不去参与这场已经令它恶心的盛宴了，它开始往回走。\n“伙计，你附近有一头小羊，看到那边的林子吗，穿过去就能找到。”\n声音来自树上的一只乌鸦。\n来不及多想什么，饥饿驱使它跟随乌鸦的指引去找那只被父母抛下的小羊，“你为什么给我找食物？”\n“什么给你找食物，你吃了之后我就能吃了，我是一只被鸦群赶出来的乌鸦，鸦群在哪我就不能在哪，我给你找猎物，你给我留食物，鸦群会羡慕我的。”\n自此，白眼狼就离开了狼群而跟着乌鸦觅食，它终于不用忍受狼群中的种种非议了，但狼群也因此更加确定它是白眼狼——人类眼中的白眼狼，同样也是狼群眼中的白眼狼。\n乌鸦和白眼狼的合作很愉快，乌鸦很好地补足了白眼狼另一只眼的缺陷——作为一只更高维度的眼睛，它也显然比白眼狼原来的那只眼睛更为出色。好似猎人用白眼狼来代替猎狗一样，白眼狼用乌鸦代替它的那只眼睛。\n在一次精妙的猎杀大型猎物的合作狩猎成功后，山林里少了一团会跑的食物，多了一份保质期不久的即食盛宴。\n白眼狼在确认自己已经饱食到往后三天可以不用进食后，躺在一旁的草丛中开始休憩，把残羹留给乌鸦解决。\n不知是多久之后，白眼狼醒来时发现它的猎物上站着一圈的乌鸦，它也记得，帮它的那只乌鸦是游离在鸦群之外的，所以它认定，这个鸦群打扰到了它朋友（亦或是恩人）的用餐。\n它决定赶走它们。\n但它不知道的是，这些是乌鸦招呼来的好友亲朋，在它向它们展示它离开鸦群后立下的丰功伟绩时，白眼狼冲上来打碎了它的形象，来客们四散而飞，而有几只不幸的乌鸦则惨死在了白眼狼的牙下。\n它再也不和它合作了。\n它再一次地成为了“白眼狼”。\n在乌鸦离开后白眼狼还是能正常狩猎的，但它常常远远地看着享受它吃剩下的食物的鸦群，有着说不出来的感觉。\n再有白眼狼的事的时候是在很久之后了，猎人终于从市场里淘到了一条还算不错的猎犬，狼群深受其害，老狼王也在这段时间惨死在猎人枪下，新狼王白狼继位后找上了这位早已被狼群遗忘的白眼狼。\n白眼狼毫不犹豫地接下了反击猎人的任务。\n“砰——”\n一头四条腿的猎杀机器从枪声来处的草丛里射出来，扑上了那只身上淌着血的鹿的身上。“好样的，今天多给你吃点。”\n狗摇着尾巴表示高兴，虽然它应该不知道自己在高兴什么。\n它突然从那一团血腥味中闻到了一种其他的动物的味道——那是狼。\n白眼狼向猎犬猛扑了过去，就像那年它向它参与猎杀的鹿扑过去一样，它恶狠狠地撕下了它的一大块肉，猎犬哀嚎着和白眼狼扭打在一起，狼群远远地听到了猎犬凄惨的哀嚎声，觉得或许这是猎人的又一什么新招式。\n当猎人赶到这两团血肉模糊的动物旁时，猎犬已经被白眼狼咬中了脖颈，断了气——狼不论怎样还是比这个后辈厉害些的。\n猎人看到这团血色中若隐若现的白眼，气不打一处来，“那天没除了你这个恶种，今天就来祸害我，我非得教你死我眼前不可！”说罢抬枪便射。\n白眼狼身上中了一弹，它呜叫着松开猎犬，又扑到猎人身上，猎人在装弹的慌乱中用手臂去挡，它便用尽全身的气力在那上面咬上了一口。\n“畜牲，我可也是你的半个爹呐！”猎人就着传遍全身的剧痛大喊一声，另一只手摔下枪拔出腰间的砍刀，他怕砍中了自己的手臂，便用刀尖向白眼狼的肚上穿去。\n血淌了下来，黏在地上，又开了一朵在那天夜里白眼狼见过的红莲，但这一次，谁都帮不了它了。\n“这白眼狼，可害得我一番苦。”在白眼狼死后，它还久久没有松口，猎人只好把它的头骨也砸碎，这才松了手臂。\n那天夜里，猎人同时吃到了三种肉。\n当白狼得知猎人失去猎犬的喜讯时，招呼狼群连夜嗥叫以纪念白眼狼的功绩。\n在许久之后的狼群中，每头狼王都会提到白眼狼作为狼的反例，狼群在那时也都只会想起那头只会分享猎物而不参与狼群狩猎的，最终抛下狼群自己过好日子去的，一只眼珠是纯白色的，白眼狼。\n原文写于2025.04.14，在图书馆复习完高数后\n后记于2025.11.24，大物期中考后\n大概能想起来当初为什么写这篇文，高中有段时间想试试动物小说，就二刷了一遍《狼王梦》，后来又在某纪录片里看到乌鸦和狼是有合作关系的，当时大为震惊，就写了文中狼鸦合作的情节\n后面偶然思考到一个问题：假如我的救命恩人要我的命，我给是不给？于是就诞生了里面猎人的情节\n以上两段缝到一起，就是这短篇了\n在这里我想写的无非就是关于狼\"白眼\"的原因：\n因为外貌而被直观认定为白眼 因为不清楚事态盲目帮忙而被指责白眼 受施恩者迫害而反目 受其他更重要的人或事影响转而攻击不那么重要的人的利益"},"title":"白眼狼传"},"/game/":{"data":{"":"有关游戏程序和游戏策划的一部分\nAI决策-状态机 游戏程序 墨守孤城 游戏拆解 九王 游戏拆解 AI决策-状态机+行为树+HTN+GOAP 游戏程序 CS炙热沙城二打法概述 游戏攻略 基于Godot的A*寻路算法 游戏程序 Godot或许合格的程序架构 游戏程序 2025TapTap聚光灯48Hgamejam成都场复盘 参赛复盘"},"title":"游戏"},"/game/2025taptap_spotlight_48hgamejam_chengdu/":{"data":{"":"放一下官方给的时间安排\n不想听经历的话可以直接看本文的文件汇总，那里面的东西看完也差不多能知道这次做了什么\n文件汇总 ↗ 飞书 注：由于我不是上帝，我复盘只能以自己的视角看，所以我自己的部分会写的更详细一些，本文中描述各人的文字长度不能代表各人的工作量（手动叠甲）","人物栏#人物栏":"人物栏默认包含五个人物，这五个人物都有相应的\"饱食度\"和\"需水量\"，当这两个中任意一个值降为0时，人物死亡\n特殊地，探索有一个机制，当某个人物进行探索时，他将不能执行额外的动作，人物会在最长一天内回来，饱食度和需水量降低，随机产生手牌资源（也可能不产生），同时也会产生随机的buff\n人物身上可以有多种buff，比如\"恐慌\"，恐慌中的人物无法行动，当人物在探索时受伤并回来时，手牌会多出一张对应人物的恐慌牌，玩家需要把这张牌拖拽到分解台，随后执行栏会产生\"分解恐慌\"任务，玩家需要派其它人物执行这个任务来让其摆脱恐慌，或者派手牌\"圣经\"执行这个任务","别人的情况#别人的情况":"如某位大佬所说，打gamejam的动机可以有很多，有的是来挑战自己的，有的是来丰富简历的，有的是来拉投资的，有的是来找idea的，有的是来找队伍的，有的是来旅游的，有的是来找男女朋友的（这是能说的吗…）","吸引点#吸引点":"要说创新点吧，也只能说游戏的逻辑在模拟经营卡牌里算是清晰的了，所以这里就说吸引点吧\n游戏中的分解台是可以分解人的，所以假如某个人物身上的debuff太多，属性值也太低，那么完全可以把这个人分解了当成食物，可以让其他人更好地活下去","好的团队#好的团队":"额标题取的不是很好，但不需要在意。。。接下来内容不是很多，就不取小标题了\n在开发过程中，我们对面那桌是五人组团（这次比赛组队上限是五人），他们有很明确的分工，一个策划，一个程序，一个美术，一个音乐，一个动画\n哇，作为一个程策美三手抓的人，我想象不到到这种一个人专职一个部分的工作流有多爽，那个策划是多年在职的，我想应该是他做的项目管理\n这也就是说，只要是团队，就不可避免地需要一个很有经验的人来做项目管理，否则各个成员后面一定会乱成一团\n哦说句题外话，坐我对面的是主美，还是大三的（不要小瞧一个梦想过当嗨客的人的信息收集能力哇），woc，素颜真好看吧🤤坐我右上角对桌的是主音，画的妆有些浓，不一定好看，而且香水味有些重，打扰我写案子\n还有一个团队，组长应该是记得很清楚的，他在回酒店之后特意跟我讨论了一会这个团队，他们做的是一个梦核的2D上帝视角移动游戏（我不知道怎么形容那种游戏类型），游戏中玩家需要移动一个小人收集地图中的某些收集物（可以简单理解为走迷宫），同时躲避这些收集物旁边环绕的怪物\n它有吸引人的一点就是，地图不仅是有模板随机生成的，还是重复生成的，玩家视野外的所有场景都是会改变的，即玩家走过这一段地形后，往回走可能就是另一种地形，这是拿来切\"梦核\"这个主题的\n除此之外我不敢恭维这款游戏，组长也说这个游戏做的有些烂\n但他们团队里有一个很nb的路演，可以把游戏吹的天花乱坠，在他慢慢吹的过程中，这个游戏似乎就真的变得切题而且有深度了，就连平时二郎腿翘到天上的那俩评委也得低下头来在地上拾掇这个游戏的优点（有些夸张，但就是能阻止别人往坏的方面看，而且还引导别人往好的方面看，而且这个\"好的方面\"还不一定是真实存在的，大部分都是捏造的，没有体现在游戏里的，比如背景故事什么的）\n不管怎么说，能来参加这个比赛的人都是经过筛选过的，至少有一技之长的，如前面提到的大佬所说，我们此行见识也结识了更多的人，也是一种收获\n以上","好的游戏#好的游戏":"以下列出几个我印象深刻的游戏和它的拆解","开发#开发":"一如上面的脑暴环节，这位在职策划又很快在脑暴结束后展现了他的职业素养，很快就给出了人员分工（不过嘛…额…某些人的工作量溢出来了，然后由于我做我的部分很快，我就把这些溢出来的工作量也揽了，所以分工后我在无限转职（那你问我，那我问你！我工作效率高我有错吗！））\n先说说游戏吧，下面分别给出系统策划案、数值策划案（第二版，完全体）、数值策划案（第三版，因工期不足而砍过内容的版本） 系统策划案 ↗ 飞书 数值策划案完全体 ↗ 飞书 数值策划案阉割版 ↗ 飞书 还有玩法策划案是那位线上美术口述的，就是上面的\"美术灵感1\"\n然后就直接写开发过程中出现的问题吧","我们的状况#我们的状况":"成员组成：系统/数值策划+副程+地编+ui美术（大二程策美，后文称\"我\"），主程+地编（大二程序，组长，因为拿的牌子是\"程序\"，故后文称\"程序\"），玩法策划+原画（大四美术，线上美术，因大部分时间在干美术，故后文称\"美术\"），动画+管理（在职策划，因拿的牌子是\"策划\"，故后文称\"策划\"）\n我和程序原先一直在合作做长期项目，本来因为要上课而不想打这场gamejam，但美术和策划在同一天找上了程序要组队，于是便因这样的机缘巧合组了队","执行栏#执行栏":"游戏中的执行栏默认包含\"治疗\"和\"探索\"位，每个位都可以放置人物牌或手牌来达成相应的目标，比如玩家可以将人物牌派去探索，当人物牌有\"受伤\"状态时，可以将人物牌派去治疗\n执行栏可以理解为\"目标集\"，后续玩家会通过拖拽手牌作用到其他栏位来增多这个目标，比如玩家可以将兔子拖到分解台，产生\"分解兔子\"的目标，随后玩家再拖拽某个人物牌执行这个目标，再比如玩家可以将冰块拖到火堆，产生\"融化冰水\"的目标，随后玩家再拖拽某个人物牌执行这个目标","时间指示器#时间指示器":"游戏中的最小时间单位是\"回合\"，每4个回合算1天，玩家在拖动手牌和人物牌后需要点击时间指示器来度过该回合","某忘记名字的吃人模拟器#某忘记名字的吃人模拟器":"参考：苏丹的游戏（制作人是这样说的，但我没玩过这个游戏）\n游戏是永续的有肉鸽元素的回合制的，目标是指挥五个人生存下去\n游戏中主要分为如下ui：\n执行栏，人物栏，手牌栏，时间指示器，火堆，分解台\n（火堆和分解台就不讲了，这两个都是用于和其他牌产生联动的）","某忘记名字的国风九宫格游戏#某忘记名字的国风九宫格游戏":"参考：九王，小丑牌\n游戏是永续的有肉鸽元素的回合制的，目标是在各个回合得到目标分数\n游戏中玩家需要将手中的卡牌（表现形式是国风的墨点，但为了方便就写卡牌了）摆放到一个九宫格中，获得每个卡牌的分数，同时触发某些卡牌相互之间的联动效果，如A效果：使上下左右的B类型分数+10，这种依位置关系产生更多分数是游戏的核心玩法\n游戏每回合结束时，会清空九宫格中的牌放回玩家手牌\n游戏的肉鸽元素在于，每张牌在每个回合的效果不是固定的，如A牌有6个可能的效果：①分数5，使上下左右的B类型分数+10②分数10\n还有一个地方的肉鸽是，每回合结束时，玩家可以从随机的三张牌中选择一张加入手牌\n游戏有一个创新点，在此称为覆盖机制，游戏中存在一类特殊的牌，只能通过卡牌三选一获得，仅能使用一次，使用它的方式是将它覆盖在已经放在九宫格中的牌上，这样已经放在九宫格中的牌的当前效果就会变成该覆盖牌的效果，且永久保留这个覆盖产生的变更\n覆盖的创新点在于，比如有一张好牌A，默认有五个好效果和一个坏效果，由于每个回合都会随机这张牌的某个效果，那么这张牌就有可能会随到这个坏效果导致这回合用不出这张牌，造成资源浪费，但假如我将一个好效果的特殊牌覆盖到这个效果上，就可以保证这张牌每回合都可以发挥作用\n（吐槽一句，作为我们团队的数值策划，我实在不敢恭维这个游戏的数值策划，因为数值实在是有点难堪，但也体现出来这类游戏数值或许就是难策划）","武器大师我更想叫它打铁模拟器#《武器大师》（我更想叫它\u0026quot;打铁模拟器\u0026quot;）":"游戏是永续的有肉鸽元素的实时的，目标是赚够足够的钱让时间流逝到下一天\n游戏中玩家需要扮演一个铁匠经营一家铁匠铺，在游戏中会依实时时间流逝出现各种顾客，玩家需要通过购买材料，打造武器，售卖给对应的顾客来赚取资金，在一天中（大概6分钟还是几分钟，我不记得了）玩家需要赚够足够的资金，否则无法进入下一天\n其中，仓库系统为类暗黑的形式，即每个材料和打成的武器部件都是不一定只占一格的\n游戏中唯一的肉鸽元素就是顾客及顾客对武器提的要求（如：游戏初期有两种顾客，“平民\"和\"贵族”，平民对武器的要求会少一些，如\"我要一个可以刺击的武器\"，贵族对武器的要求会多一些，如\"我要一个长柄的可挥砍也可刺击的武器\"）\n游戏中存在多种材料和多种可生产的部位，材料有如：石头，木头，铁锭，银锭，部位有如：长柄，短柄，短剑刃，长剑刃，刺剑刃，玩家通过使用不同材料打出不同的部位，再按一刃一柄的标准来组装武器，有一种自由组合的效果，也算是一种扩展性\n游戏中的切题点在于，玩家在打铁的时候需要频繁点击鼠标左右键，来达到\"打铁\"的效果（有点沙威玛的味道），这与游戏中的其他系统的联动的地方在于，玩家使用不同材料打造不同部位所需要的时间是不同的，那么玩家就可以选择花很长时间打一把材料非常好，非常符合顾客要求的武器，也可以花很多零零散散的时间用垃圾材料供给零散顾客给的单子，也有模拟经营铁匠铺的味道","程序框架#程序框架":"我和组长都是做程序的，其中组长主程，我辅助，我做的部分主要是耦合性不强的科技树系统和简单的敌人ai系统\n但在此之前，主程没有做过横板动作游戏的长期项目，在打框架上出了些漏洞，我由于拿ue做过类似的游戏，所以我还是勉强能接住的\n或许下次应该多考虑之前做过的游戏类型，当然，平时也得试着去做其他的游戏类型扩展模板库","策划的对接#策划的对接":"这场比赛有三个名义上的策划，其中美术负责玩法策划，他会在会议里告诉我他想把这个游戏做成什么样，有哪些机制，然后我就按他的描述把游戏拆分成一个个系统（我拆解那么多游戏的经历终于派上用场了），写出来上文的\"系统策划案\"\n在这个过程中两边传输的信息有些明显的失真，导致我还需要额外花些时间去问某些系统的具体细节（当然也有我的问题，在一次开会中没有把需要的信息完全问清楚）","结果#结果":"项目仓库 ↗ GitHub 发布页面 ↗ TapTap 不论如何，比上2025ggj还是好不少的（不和21天聚光灯比是因为时间不等没有比较价值），好歹我们也只是大二，还在慢慢积累经验\n不过到最后大家都心照不宣地没有摆摊，这还是有些遗憾的","美术的对接#美术的对接":"这场比赛有两个名义上的美术，其中线上美术负责画人物/道具/场景原画，策划负责拿人物原画生成人物移动/攻击/死亡动画，我负责把原画和动画转成程序能直接用的资源（比如把动画转成精灵表），同时也负责设计ui和地编\n在脑暴后的分工环节，我是不负责任何美术部分的，但由于动画直接给的序列帧的大小有些偏差，导致给出的资源程序不能直接用，所以我接手了转换工作，由于美术产出有点赶，为了能快些做出原型，所以我负责了设计ui和地编（当然，上面这些我还是有些经验的，不然我也不会接）","脑暴#脑暴":"先说主题，“模拟器”\n在这个阶段，那位在职策划很自然地展现了他的职业素养，她第一时间明确了脑暴需要产出的成果：（原文）\n每个人可以去steam，tap或者微信小游戏排行榜，或者ai创作想法搜集一下，模拟器这个主题沾边的或者不沾边的都可。每个人准备2-3个及以上，写出①推荐原因比如趣味性可玩性②简要玩法，③可实现性。时间截止：下午四点\n后面也是自然而然地大家都按着这个标准来，得到了以下结果：\n策划灵感 ↗ 飞书 我的灵感 ↗ 飞书 程序的灵感 ↗ 飞书 美术灵感1 ↗ 飞书 美术灵感2 ↗ 飞书 最终我们拍板了美术灵感1，决定做出：玩家扮演一个狡诈的哥布林，利用陷阱来吓跑或杀死进犯洞穴的人类，保护洞穴深处核心，的横版动作游戏，原型名为\"哥布林模拟器\"，最终名为\"我是哥布林\"\n这里提一嘴，在脑暴末尾有两个可选的灵感，一个是这个，还有一个是我的\"gamejam模拟器\"，但由于我和主程做卡牌做吐了想换换胃口（不过想换胃口为什么我还要写这个灵感？因为我的灵感大多都是兜底的，保证能做的），且策划说可能会和别人的想法撞车（不过吧要说撞车我感觉什么想法都能撞车，而且最终也没有团队做gamejam模拟器）","逃离俄罗斯方块#《逃离俄罗斯方块》":"这可得说道说道了，这是我全场给的评价最高的一款游戏\n游戏是永续的有肉鸽元素的实时的，目标是得到更多分数（说实在的，作为一个内核是类俄罗斯方块的游戏，我不认为这个游戏有明确的目标）\n游戏结合了\"俄罗斯方块\"和\"推箱子\"两个经典游戏的核心机制，随时间实时流逝，场景上方会有几种组合的方块慢慢落下（这里就不讲那么详细了，毕竟就是俄罗斯方块）\n同时，玩家可以操控场景中的一个小方块（这个方块是随着第一个方块落下的，当第一个方块落地时，玩家就可以操控这个小方块）在方块和空地间有子弹时间地移动\n当存在玩家将要移动的方向所在的方块后方有空地时，该方块将被移动到该空地处（或许听着有些绕，但可以直接理解为推箱子，任何已落地的方块都是箱子，玩家可以在箱子中穿梭，只要玩家推的箱子方向有空地，箱子就可以被推动）\n我问过这个作者有关这游戏的想法，也听了他的路演，他说切题点在于玩家通过模拟移动一大段路径来得到满足感（原话我不记得了，大致意思是玩家规划了一长串路径后让错误的方块得到消除可以让玩家很爽），说实在的，这似乎和\"模拟器\"搭不上边，只能勉强扯到\"模拟\"这样的元素\n这个游戏我评价为\"极简塔防\"级游戏，机制简单但太有深度了，要是能扩展些东西不敢说比肩《极简塔防》，也得有一小批忠实受众"},"title":"2025TapTap聚光灯48Hgamejam成都场复盘"},"/game/ai_decision_tree_state_machine/":{"data":{"":"","1-前言#1 前言":"我在使用godot开发一个RTS游戏的时候，我突然发现游戏中的单位(Unit)有且仅有三个动作（当时没有考虑\"状态\"，而是直接将这些定义为动作）：静止，移动，攻击，或者他们的组合（比如边移动边攻击，当然，别和我杠边静止边移动）\n然后就诞生了这样一个无限递归函数的流程图：\n可nb了，当时我就觉得，wow，我简直是一个逻辑大王，直到我知道这么做会栈溢出…\n然后就去学了状态机，把上面的逻辑通过状态机写成了这样：\n他们两个看上去逻辑是一样的，但区别就在上面的不能用，下面的能用，所以，状态机有什么用？\n即答：让不能用的东西变得能用！（bushi\n答：让actor个体（你说GameObject或CharacterBody也行，主要是我从虚幻开始学的，用actor习惯了）的行为用状态表示，从而减少逻辑混乱，增强代码可维护性和可扩展性","2-用硬代码实现状态机#2 用硬代码实现状态机":"","21-逻辑#2.1 逻辑":"想象一下，我们只有一个enemy场景，和一个附着在enemy根节点上的脚本，这个脚本要全权负责enmey的巡逻，追逐，攻击逻辑（经典的patrol-chase-attack循环），我们该怎么写？\n既然用状态机，那么我们就把这三个变成状态吧，我们有巡逻状态，追逐状态，攻击状态，自然，我们需要一个枚举来存储这个分类，还要有一个变量来存储当前状态，嗯，好，记得要做这两个\n然后我们要处理一下动画，我们得三个状态显然要有不同的动画，那么我们就可以在更改当前状态时同步更改它的动画，那么要记得在更改状态的函数中同步更新动画\n再者让我们想想，我们要怎么样更改状态呢，比如从patrol转到chase？或许你有许多种方法，比如添加一个Area2D然后把它的area_entered信号连接到根节点脚本中，但我们在这里还是只谈脚本中处理的方法\n那么我们就需要知道玩家在哪，敌人在哪，当玩家与敌人近到一定程度时就更改状态，这里我们用硬代码直接在tick里写，当我们的当前状态为patrol时，实时获取玩家与敌人位置，当二者距离小于侦查距离时，转换状态为chase，chase到attack的转换同理，二者距离小于攻击距离时，立刻攻击玩家，然后状态转为patrol\n以上，一个硬代码状态机就实现了，好了，那么纸上谈兵结束了，现在自己对照下面的代码看上面的解释吧","22-实现#2.2 实现":"那么就用一下硬代码实现一下状态机吧\n这个硬代码是我从YouTube上一个老哥的博客学来的（啥不是学来的嘞，你说是不吼），以下是原帖，我改成了更简单的版本（原版是scanning-firing-charging循环，但我改成我觉得更简单易懂的patrol-chase-attack循环）\nGodot 4 中的启动状态机 - The Shaggy Dev — Starter state machines in Godot 4 - The Shaggy Dev\n（这个文章里同时有硬代码方法和进阶状态机方法，看上半部分就行）\n（记住，不要用硬代码写状态机，除非你敢拿头保证你不会增加很多很复杂的状态或复合状态！）\nextends Node enum STATE { PATROL , CHASE , ATTACK } #在此定义状态机中的所有状态 @export Player : PLAYER #对玩家引用来判断是否在侦查范围内 var current_state : STATE = PATROL #定义\"当前状态\"并赋初始值为PATROL @export var animation : AnimatedSprite2D #这个动画状态机没有任何架构上的意义，你可以不用管它，我只是想突出状态应该要有的enter函数而已，让我的那个更改状态的函数变得不那么蠢 @export var detect_distance : float #侦查范围 @export var attack_distance : float #攻击范围 func change_state(new_state : STATE) : current_state = new_state match current_state : STATE.PATROL : animation.play(\"patrol\") STATE.CHASE : animation.play(\"chase\") STATE.ATTACK : animation.play(\"attack\") change_state(PATROL) func _process(delta) : match current_state : STATE.PATROL : if Player.position.distance_to(position) \u003c detect_distance : change_state(STATE.CHASE) STATE.CHASE : if Player.position.distance_to(position) \u003c attack_distance : change_state(STATE.ATTACK) func _physics_process(delta) : match current_state : #这下面的函数我就不写了，毕竟重心不在实现enemy动作，而是实现状态机的结构 STATE.PATROL : random_move() STATE.CHASE : move_to_player(Player) STATE.ATTACK : attack(Player) 结束了，框架没了，是不是很简单？对，状态机就是这么简单","3-用statemachine父节点state类子节点实现状态机#3 用StateMachine父节点+STATE类子节点实现状态机":"","31-约定俗成#3.1 约定俗成":"知道了上面硬代码实现状态机的方法，有一些东西我就不重复了，知识直接extends过来就ok\n现在我们讲讲一个状态应该有什么\n什么？什么叫应该有什么？这是什么意思？意思就是状态这个东西的规范形式\n它会有四个函数，分别是\nEnter() 在状态改变为当前状态时调用，抽象理解为godot中的_enter_tree()\nExit() 在离开该状态时调用，理解为_exit_tree()\nUpdate() 与_process()绑定调用，用于处理渲染\nPhysics_Update() 与_physics_process()绑定调用，用于处理逻辑\n以上都是约定俗成，但我觉得它们应该能对你理解接下来的代码有点帮助","32-实现与理解#3.2 实现与理解":"以下是我适应的在godot中使用的状态机写法\n原帖\nFinite State Machines in Godot 4 in Under 10 Minutes - YouTube\n首先定义STATE这个东西，我们得知道STATE是什么，有什么默认函数（定义STATE类）\n#STATE.gd extends Node class_name STATE #这里就是定义STATE signal ChangeState #在要更改状态时发出信号，这个信号将附带有将要转向的状态的字符串形式，然后我们在状态机中用字符串查找到的状态来替换当前状态 func Enter() : #这个函数将在进入该状态时调用 pass func Exit() : #在退出该状态时调用 pass func Update(delta) : #和_process绑定，用于处理渲染tick pass func Physics_Update(delta) : #和_physics_process绑定，用于处理逻辑tick pass 为什么上面的函数都是空的？\n因为后面会根据状态不同直接覆盖这些函数\n然后就是状态机了，先想想状态机应该有什么？\n状态机得：\n初始化状态（如果有） 知道能有几种状态（状态的字典） 知道当前状态是什么（知道当前要执行哪个状态的函数） 能改变状态（有改变状态的函数） 没了！那就写吧！\n#StateMachine.gd extends Node class_name state_machine var state_dictionary := {} #这里是2 var current_state : STATE #这里是3 @export var init_state : STATE #这里是1 func _ready() : #这里是2 for child in get_children() : if child is STATE : state_dictionary[child.name.to_lower()] = child #状态字典，键为状态的小写字符串形式，值为状态（子节点），这里的小写是用于保证代码安全的写法，避免因为大小写不同而检索不到相应的状态名 child.change_state.connect(_change_state) #绑定信号到函数 #这里是1 if init_state : current_state = init_state current_state.Enter() #这里是3 func _process(delta) : if current_state : current_state.Update(delta) func _physics_process(delta) : if current_state : current_state.Physics_Update(delta) #这里是4 func _change_state(new_state) : if current_state : current_state.Exit() current_state = state_dictionary[new_state] current_state.Enter() 接下来用patrol-chase-attack循环来演示状态节点\n#patrol.gd extends STATE class_name PATROL @export var enemy : ENEMY #这里是用引用的方法来让根节点实现当前状态的逻辑的 @export var player : PLAYER #引用Player检测玩家是否进入侦查距离 var detect_distance : float #侦查距离，当玩家与敌人的距离小于这一距离时，更改状态为chase var wander_time : float #为了不用强制多线程的timer，这里用最朴素的方法写计时器 var current_wander_time : float func random_move() : pass #这里我就不演示了，反正就是enemy的运动逻辑 func Enter() : random_move() func Update(delta) : if wander_time \u003e 0 : current_wander_time -= delta else : random_move() current_wander_time = wander_time func _Physics_Update(delta) : #当玩家与敌人距离比侦查距离小时，将状态转换为chase if player.position.distance_to(position) \u003c detect_distance : change_state.emit(\"chase\") 以上\n这个状态机的思路就是：\n给根节点一个节点StateMachine 在StateMachine下添加STATE类节点 StateMachine实时调用current_state的逻辑 STATE节点获得对StateMachine的引用实现更改current_state逻辑 STATE节点获得对根节点的引用实现STATE逻辑 下面写一个进阶的状态机写法\nToDo（希望不鸽）"},"title":"AI决策-状态机"},"/game/ai_decision_tree_state_machine_behavior_tree_htn_goap/":{"data":{"":"","1-前言#1 前言":"先放一下b站上games104关于简单ai的介绍视频\n16.游戏引擎Gameplay玩法系统：基础AI (Part 2) | GAMES104-现代游戏引擎：从入门到实践\n17.游戏引擎Gameplay玩法系统：高级AI (Part 1) | GAMES104-现代游戏引擎：从入门到实践\n本篇是基于该games104视频内容的笔记性质的总结，根本目的是为本人理顺其中略微混乱的内容，具体内容以该视频为准（手动叠甲）\n再放一篇大佬的帖子🙏受益匪浅\n# GOAP与游戏AI简述 —— 技术篇 博客","2-主观概述#2 主观概述":"简单ai中最古老最基础也是最容易理解的就是状态机，状态机的写法要求开发者给ai体设置多个\"状态\"，具体表现为——规定ai体在某个\"状态\"下执行的动作，为状态之间的转换设置条件\n其中需要明确的是，\n在任何时刻下的ai体都需要处于某\"状态\"中（可以不止一个，详见\"并发状态机\"） 任何状态都需要有被转换和转换为其他状态的条件（否则就相当于走进死胡同了） 状态的转换条件需要是可量化的（不然机器读不懂） 我对状态机的理解是特殊的循环，还有进阶一点的分层和并发状态机此处不赘述\n状态机概念图 但当外界情况复杂起来，ai体有大量状态时（或许可以用分层状态机简化，但这里假设分层之后仍复杂），常规的状态机写起来就会让人头大，毕竟新的状态很可能要飞很多根线连到原先的状态，这个时候我们就得用到行为树了（提一嘴，视频里提到行为树起源于03-04年间的halo）\n我主观认为基础行为树是可以脱离状态机来理解的（因为我玩UE的时候是先接触了行为树再接触状态机的💦）\n我对行为树的理解是特殊的遍历+if-else，至于有多特殊就等下展开\n行为树概念图 到后面的HTN（Hierarchical Tasks Network 层次任务网络）和GOAP（Goal-Oriented Action Planning 目标导向行为规划）就必须要提到，前面的状态机和行为树像是条件反射般地执行开发者设定的任务，而这两个ai就更像是开发者给ai设定一系列可选的行为，ai通过感知这个世界自己设定目的，然后根据开发者所给来选择要做的事\n我们可以简记为：前两者是条件反射，后两者是目标导向\nHTN概念图 GOAP概念图","21-全篇速览举例#2.1 全篇速览举例":"（这个例子看不懂的话就是不会接下来要讲的东西）\n此处举一个比较直观的例子：我们需要做一个项羽和一个刘邦(实际上是一个勇敢的小兵和一个有智慧的小兵)","211-用状态机的写法#2.1.1 用状态机的写法":"项羽有\"巡逻\"，“冲锋”，“开大”，这三个的转换关系分别是，默认处于巡逻状态，在看到敌人后向其冲锋，当与敌人距离小于某个值时开大，随后直接进入巡逻状态，以此反复\n刘邦就有\"待命\"，“摇人”，“撤退”，这三个的转换关系分别是，默认处于待命状态，看到敌人后进入摇人状态，随后直接进入撤退状态，在看不到敌人后进入待命状态，以此反复","212-用行为树的写法#2.1.2 用行为树的写法":"每隔一段时间执行一次行为树\n项羽：若看不到敌人就巡逻，若看到敌人就冲锋，冲锋后若敌人在身旁就开大\n刘邦：若看不到敌人就待命，若看到敌人就摇人，然后撤退\n其中是否看到敌人就是状态节点，其余逻辑就是动作节点，根节点是Sequence","213-用htn的写法#2.1.3 用HTN的写法":"（以下仅以项羽举例）\n在HTN Domain中定义以下Node：\nprecondition action effect 看到敌人 \u0026\u0026 不在敌人身边 冲锋 在敌人身边 看到敌人 \u0026\u0026 在敌人身边 开大 无（造成伤害） 看不到敌人 巡逻 无（移动）","214-用goap的写法#2.1.4 用GOAP的写法":"（以下仅以项羽举例）\n在Goal Set中定义以下Node：\nprecondition goal state priority 看到敌人 \u0026\u0026 在敌人身边 攻击敌人 无（造成伤害） 1 看到敌人 \u0026\u0026 不在敌人身边 靠近敌人 在敌人身边 2 看不到敌人 巡逻 无（移动） 3 在Action Set中定义以下Node：\nprecondition action effect cost（这一栏需要根据情况定） 攻击敌人 开大 无（造成伤害） ？ 靠近敌人 冲锋 在敌人身边 ？ 巡逻 巡逻（具体逻辑） 无（移动） ？","3-状态机#3 状态机":"AI决策-状态机 游戏程序 （基础状态机请见我之前的帖子，那是基于YouTube教程的总结，此处不展开）","4-行为树#4 行为树":"（要了解行为树，我会推荐看看UE蓝图行为树是怎么样的）\n原教程用这样一句话来引入行为树：“人的思考是分支性思考”\n行为树就是如此，用自然语言来描述一个行为树时，我们会这样说：当有作业要写时，我会看看我的手上/桌子上/抽屉里有没有纸笔，有的话就拿过来开写，没有的话就去教室/图书馆/失物招领处找纸笔，假如还没找到就去文具店买纸笔（有纸笔后再次执行行为树，就会跳到有纸笔的分支执行写作业的逻辑）——这就是一个极简的行为树","41-构成#4.1 构成":"行为树由Node构成，节点分为Execution Node和Control Node\nExecution Node分为Condition Node和Action Node\nControl Node分为Sequence，Selector，Parallel，Decorator共3+1种（Decorator比较另类）","42-execution-node可执行节点行为树中的叶节点#4.2 Execution Node（可执行节点，行为树中的叶节点）":"","421-condition-node#4.2.1 Condition Node":"（视频翻译为条件节点）\n条件节点是一次对当前情况的判断，如：判断自己是否处于Powerful的状态？判断是否有Ghost正在追击？\n返回值为true/false\n我的理解中条件节点是一个门，当行为树执行到这个门时进行判断，向上返回true/false决定控制节点是否继续执行下去\n比如Sequence可以先执行几个动作节点，在这些动作节点同行的后方加上条件节点，在执行条件节点后若返回true就继续执行后面的动作节点，若返回false就中断本次行为树的执行","422-action-node#4.2.2 Action Node":"（视频翻译为动作节点）\n动作节点是对具体动作逻辑的实现，比如执行移动，攻击的函数\n返回值为success/failure/running\n返回值的作用是告诉上方节点该动作的状态","43-control-node控制节点#4.3 Control Node（控制节点）":"我的理解是这类节点就像是行为树上树枝分叉的地方","431-sequence#4.3.1 Sequence":"标志着\"顺序执行\"\n当行为树执行到该节点时，会依次执行其下所有子树，直到条件节点返回false或动作节点返回failure，当动作节点返回running时，会等待该动作节点执行，直到返回其余两值其一\n例： Sequence -\u003e 状态节点：门是锁着的？ -\u003e 动作节点：解锁门 -\u003e 动作节点：开门 -\u003e 动作节点：进门\n任何一个Sequence向上反馈的是和动作节点相同的状态类型，即success，failure，running，这个反馈取决于它执行的动作节点的返回值\n比如：\nSequence执行的动作节点返回running，那么Sequence就返回running，让这片区域的行为树停止一轮 假如Sequence执行的动作节点返回failure，就可以向上反馈说这套动作失败了，需要重新执行行为树 （看到这里不妨想一想状态机要怎么实现反馈失败动作并重新执行的，是不是就得飞根线回到初始的状态，是不是麻烦，行为树就简单了）","432-selector#4.3.2 Selector":"标志着\"优先执行\"\n当行为树执行到该节点时，会依次执行其下所有子树，直到第一个动作节点返回success（就是依次执行动作，只要有一个成功了就不往下执行了）\n（当然，开发者也可以定义特殊的Selector，比如要求至少得到2个success才返回，这个就自由发挥了）\n理解了Sequence就很好类推到Selector了，它的返回也和Sequence一样的，不赘述","433-parallel#4.3.3 Parallel":"标志着\"并行执行\"，就好比是移动射击，是两个行为叠加在一起的\n视频里只有一张ppt上有parallel伪代码实现但并没有展开讲，此处给出的是其他地方的理论\nParallel的关键词是\"并发 tick、记录状态、阈值判断\"\n并发tick 这里和并发状态机类似，并发状态机简单来讲就是在一个根节点的tick中执行多个状态机的update，这里parallel也是同理，它将同时执行所有子节点的逻辑\n比如：parallel -\u003e 移动 -\u003e 射击 -\u003e 跳跃\n这样就会出现巴西跳扫(bushi\n记录状态与阈值判断 执行所有子节点不是一股脑执行就完事的，还需要收集它们所有的返回值（success，failure，running），同时parallel也会存储一个或多个阈值（通常来说只有success和failure的阈值），当子节点的返回值达到某个阈值时，就向上反馈自身状况（success，failure，running）并终止执行\n比如：（还是前面那个跳扫的例子）当手上的枪没子弹时，射击就会返回failure，这时假如该parallel的failure的阈值为1，那么就会立刻终止running的移动（跳跃应该是success），同时请求重新执行行为树，这时候大概就会换到另一个换弹的子树上去\n通过调节阈值，可以实现各种复杂的并行行为策略，例如\"等待至少两个条件满足\"，“所有任务都必须完成，但其中一个失败则立即放弃\"等","434-decorator#4.3.4 Decorator":"作为修饰而存在的节点\n当开发者想要执行一个这样的行为：移动 -\u003e 暂停1s -\u003e 反向移动 -\u003e 1s ，我们当然可以把暂停1s写成一个Action Node，也当然可以把暂停1s写进移动的Action Node里面，但没必要，于是就有了Decorator，可以简便地在每个Action Node前添加小段逻辑（而不必要多new一个Action Node类）","44-节点总结#4.4 节点总结":"前五节点如下表（原视频这里有两行是反的，在此更正了）\nNode Type Symbol Succeeds Fails Running Sequence → If all children succeed If one child fails If one child returns Running Selector ? If one child succeeds If all children fail If one child returns Running Parallel ⇄ If ≥ M children succeed If \u003e N - M children fail else Condition text If true If false Never Action text Upon completion If impossible to complete During completion","45-黑板blackboard#4.5 黑板Blackboard":"是存储行为树输入输出数据的地方\n我们当然可以散装存储ai体感知到的各种数据，但黑板的存在就是为了更方便地调用它，实现数据库分离那啥的思想嘛\n当环境发生变化时，黑板中的数据会通过ai体的感知随之改变，ai体行为树中的状态节点都是读取黑板中的数据进行判断，动作节点也会在特定时间修改黑板上的数据，这一点也是在后面的HTN和GOAP的Sensor和World State的基础","46-行为树扩展#4.6 行为树扩展":"","461-行为树tick#4.6.1 行为树Tick":"行为树在每个周期都需要从根节点开始tick（所以当行为树和状态机都很大的时候，看着更复杂没条理的是状态机，用着性能开销大的是行为树），所以，当外界环境发生突变时，行为树也能很好地应对，如正在巡逻时发现了敌人，那么下一周期的行为树将停止running的巡逻，转而到负责攻击的子树的parallel或sequence啥的里面去（移动+攻击）\n这里有一个扩展的部分，即event优化行为树tick，此处不展开，因为视频里也不主要讲这个","462-行为树优化-precondition#4.6.2 行为树优化-precondition":"本质上是作为简化逻辑存在的\n有一些子树，如：sequence -\u003e 状态节点：门是锁着的？-\u003e 动作节点：回头\n它的存在就显得行为树有些臃肿，那么我们就可以把它简化成一个带有precondition的Action Node，只需要在回头这个动作节点的最前面加上一个判断门是否上锁就行了，写进类里面就是precondition","5-htn和goap#5 HTN和GOAP":"HTN和GOAP在框架上其实是很类似的，所以在此放到一起来讲，我在此先写HTN的架构，再说GOAP从HTN上面换了些什么","51-htn核心思想#5.1 HTN核心思想":"“从目标出发”，即先立靶子，然后打靶\nHTN概念图 如上图，ai体会通过Sensor量化出World State（通常为bool），再依据World State从HTN Domain中获取任务，在Planner中将获取到的任务排成队列，然后在Plan Runner中依次执行","511-htn速览举例#5.1.1 HTN速览举例":"比如我是一个小兵，我的大招很厉害，那么我的HTN Domain中就会有一个Node是这样的：\nprecondition：敌人很多(true)\naction：开大\neffect：敌人不多(false)\n那么怎么触发这个Node呢？\n首先我会通过Sensor感知外部环境，这一步通常是用碰撞或区域检测完成的，即有多少个敌人在我的视野范围内，这些是Sensor的向World State传递的内容 随后我会根据这个返回值判断敌人多不多，比如有一个阈值，大于这个值就多，小于这个值就少，随后就在World State中写入关于敌人多不多的bool值 在Planner中依次判断World State是否符合HTN Domain里任务的precondition，假如符合就把它放入队列中 最后在Plan Runner中执行任务并根据effect修改World State","52-htn的primitive-task#5.2 HTN的Primitive Task":"基本构成为：precondition+action+effect\n其中，\nprecondiotion用于判断该任务可否执行，通常为对从World State中返回值的判断（bool） action为任务的执行逻辑，比如执行移动函数，执行攻击函数什么的 effect为任务对World State的反馈，通常为改变World State中的值 比如视频中举例的解毒Primitive Task，precondition为中毒(true)且有解毒药水(true)，action为使用解毒药水，effect为失去中毒(false)和无解毒药水(false)（假设最多存储一个解毒药水，用了就没有了）","53-htn的compound-task#5.3 HTN的Compound Task":"听前面的课程的时候其实我云里雾里的，因为光靠这样的任务只能构成一个糟糕的ai逻辑，我们的小兵会在和敌人战斗的时候突然收刀喝药或者喝药喝到一半突然翻滚然后不喝药了转而去打架什么的，这时候就得用上Compound Task了","531-priority#5.3.1 priority":"首先引入priority（优先级）的概念，这个概念很好理解，就像行为树里的Selector一样\n我能这样干就不那样干，体现在ai逻辑里就是，我能喝解毒药，抗火药，红药，蓝药就不去喝万能药（假设万能药可以回满状态）","532-method#5.3.2 method":"再引入method（方法）的概念，即我可以有一个连串的动作去完成一个既定的目标\n比如我现在中毒了，手上只有万能药喝制作解毒药的材料，我就可以去做解毒药然后喝解毒药，这时就可以说，“喝万能药\"和\"做解毒药并喝\"是两个method，再根据上面优先级的概念，“做解毒药并喝\"的优先级显然大于\"喝万能药”，那么前者就会被Planner放入队列中，被Plan Runner执行了\n但在这里，前者的method将由两个Primitive Task组成，即\nPrimitive Task1 Primitive Task 2 precondition 中毒(true) \u0026\u0026 无解毒药(false) \u0026\u0026 有做解毒药的材料(true) 中毒(true) \u0026\u0026 有解毒药(true) action 做解毒药 喝解毒药 effect 失去材料(false) \u0026\u0026 有解毒药(true) 失去中毒(false) \u0026\u0026 无解毒药(false) 视频里更简单的理解是Selector + Sequence的组合，没错，就是这个感觉","54-htn的tick和world-state#5.4 HTN的tick和World State":"到此就得讲一下HTN的tick形式了，首先回忆一下状态机的tick形式是状态变化时tick，行为树的tick形式是每一帧tick，而HTN的tick形式则是World State改变时tick\n对于World State，视频中的解释是，HTN和GOAP的ai像是把世界以自己的方式抄下来，比如看到10个敌人就抄为\"看到很多敌人”(true)，有1个草药和1个空瓶（假设是制作解毒药的材料）就抄为\"有制作解毒药的材料”(true)","55-htn的planning#5.5 HTN的Planning":"现在就得开始做规划了，我们需要在这里把ai体接下来要做的事情排成一个队列（可以理解为排列要执行的Task）\n首先遍历HTN Domain中的method，看World State是否满足它的precondition，找到满足的，就把它放入将要执行的任务队列里\n这里的遍历要怎么遍历呢？就是把method里的Task一层层展开，直到最底层的Premitive Task，随后比对其中的precondition，假如有不符合的就放弃这个method转而去下一个method\n这里有一个至关重要的细节，那就是当ai体遍历到了可执行的Primitive Task后，需要把它的effect同步更新到World State里，假如后续决定不执行这个Primitive Task，再把effect更新回去\n举上面解毒药的例子，Compound Task由两个Primitive Task组成，假如在遍历Primitive Task 1时不更新World State，那么就不可能满足Primitive Task 2的precondition\n如此这般之后，planning就结束了，我们会获得一个仅以Primitive Task按优先级顺序形成的队列（Compound Task会被拆成Primitive Task）","56-htn的replanning#5.6 HTN的Replanning":"众所周知，做任何事情都需要时间，那么当ai体执行plan队列时外部环境发生变化，ai要怎么办？状态机会根据状态转换跳到其他状态，行为树每一帧都tick不需要考虑这个，HTN要怎么办？\n其实就是重新规划\n首先Sensor会告诉World State外部环境发生变化，此时会直接中断正在执行的Plan Runner再转回Planner中重新做计划\n再比如说，我的某个动作失败了，ai要怎么办？比如我的某个Primitive Task是打开某门，我在规划时有钥匙，但这把钥匙在路上被偷走了，那么此时World State就会发生变化，就会强制中断Plan Runner的开锁计划，转到其他的method里去","57-goap相对于htn的结构变化#5.7 GOAP相对于HTN的结构变化":"最明显的莫过于将HTN Domain换成了Goal Set + Action Set\nGoal Set称目标集，包含所有ai体可达成的目标（仅用数学方法表述），Action Set称动作集，含所有ai体可执行的动作\n我们可以直观地理解为，HTN更像是做了一天的规划，而当这一天突然发生某些变数时，这个规划就得完全弃置，然后ai体就要重新开始规划，而GOAP更像是列了今天要干的事和今天能干的事，至于干什么就根据情况再定（有些抽象，看下面展开吧）","571-goal-set#5.7.1 Goal Set":"Goal Set由一些列Goal节点组成，Goal节点是一个由precondition，goal，state组成的节点，其本身有priority属性\n以下是视频中举的一个Goal Set的例子\nprecondition goal state priority 中毒 解毒 失去中毒 1 发现敌方是精英怪 逃跑 无 2 发现敌方是小怪 攻击 无 3","572-action-set#5.7.2 Action Set":"Action Set由一些列Action节点组成，Action节点是一个由precondition，action，effect，cost组成的节点，其中cost为开发者的经验输入，用于告诉ai体这个行为的消耗大小，从而规划更好的Action队列","58-goap的planning#5.8 GOAP的Planning":"这里直接放我的笔记，因为视频里这一部分讲了两遍有点混乱，理解了这个就理解了GOAP基本逻辑了，视频里讲清晰的地方从此处开始：\n17.游戏引擎Gameplay玩法系统：高级AI (Part 1) | GAMES104-现代游戏引擎：从入门到实践 【精准空降到 57:31】\nStep 1 根据priority检查Goal Set\n找到precondition符合World State且优先级最高的一个goal\nStep 2 比较goal的state与World State中的state\n将为满足的state扔到栈stack of unsatisfied states\nStep 3 检查stack of unsatisfied states中第一个未满足的state\n从Action Set中查找是否有Action的effect可以使该state改为goal需要的state（此处的effect通常称为set state）\n将这个Action放入将执行的计划栈中（plan stack）\nStep 4 若将要放入plan stack中的Action的precondition未被满足，则将该precondition作为state放入stack of unsatisfied states中\n继续执行Step 3，直到stack of unsatisfied states清空\n输出plan stack作为计划执行队列交给Plan Runner\n（以上有不严谨的地方，如在plan stack中的Action的先后顺序未被提及）","59-goap图#5.9 GOAP图":"到上面那段其实AI就已经讲完了，这里的GOAP图一般是用辅助理清楚GOAP逻辑的\n首先我们约定图例：\n节点：World State\n边：Action\n距离：Action的cost\n那么一张GOAP图就像下面这样：\nGOAP图举例 比如当前的World State是A，目标是到达C，那么从A到C这中间的过程就是ai体要执行的Action，ai体需要寻找一个cost最小的一些Action执行\n（看着是不是很眼熟？路径规划，淦！这不是A*吗，动态规划转A*这一块）\n以上"},"title":"AI决策-状态机+行为树+HTN+GOAP"},"/game/cs_dust2/":{"data":{"":"先放一张报点图，不过说实话也用不着那么多报点，记住以下常用的就好：（假如看到名字可以想起它在哪，就相当于记住了）\nB包点：狙位，大箱，死点，狗洞，白车\nB外：脚手架，沙地\nB通：B2，B1，旋梯\n匪家：后花园\n中路：暗道，L位，中远，X箱，中门\nA小：躲闪位（我喜欢叫A小箱子）\nA包点：忍者位，二箱，一箱，爆头位，电梯位，狙位，斜坡\nA大：蓝车，厕所，大坑，蓝箱，A门","a小b1-l位中远#A小/B1-L位/中远":"均势\n当ct顶A小时一般都需要带一个顶B1的，此时暗道和中远都可能会出人（暗道出是劣势），B1的ct需要负责侦察（B1是劣势，地形不好，容易被单摸的匪偷掉），A小的ct由于没有暴露信息主要负责对枪，大部分情况下打掉一个就可以撤了","a门-a大拐角#A门-A大拐角":"ct优势\nct和t都抢A大时，双方会在此相遇，此时ct在A大拐角，t在A门里正对A大拐角，需要注意的是，此时双方都没有交火能力（都切刀或切道具）\n这里主要讲ct如何控A大，无配合情况下，ct第一身位丢火缩回拐角，由第二身位对枪，或者，ct第一身位给漂移火下大坑，和第二身位打交叉，此时对枪点位就变成了A门/蓝箱（t第一身位一般跳蓝箱）-大坑/A大拐角\n更理想的情况是，ct第一身位丢A门火同时第二身位丢出蓝箱火，第一身位再丢反清闪和第二身位双拉","b通-b包#B通-B包":"ct优势\n通常只要t不rushB，这里是不会第一时间交火的，t单摸的人也不会蠢到单人清B包（当然，纯的除外）\n这里ct的控图很简单，只需要ct在过B门时给火，随便要不要侦察都可以，只要在火快灭时给烟就行\n给烟之后主B的ct可以选择跳竖箱或躲大箱后，架烟即可，我会更推荐跳竖箱，可以拿到B通的信息，如果中路压力过大可以选择去狗洞，让中路队友回警家，这样可以在沙地打中路出的t的交叉","ct默认及打法#ct默认及打法":"一般情况下t是不会有默认的，所以这里就讲下ct的默认，由于本张图ct只有五个出生位，所以ct打默认的位置和出生位是绑定的\nct默认1B1中3A，右边第一个主B，右边第二个中路，中间去A小，左边两个去A大\n主B的站住包点内即可，激进点站竖箱上，保守点站狙位，大箱后，团队点站狗洞，卖队友站白车，假如t这把开局不打B的话那这局就和主B的没多大关系了，和米垃圾主B，nuke主铁板的一样，是坐牢位\n主中路的主要负责侦察中远和A小，并不负责对枪（沙地m4对中远ak纯属炸鱼，对面eco局或大狙除外），因为这张图在封警家隔断烟前中路压力不大，匪出中路的情况及其罕见\n站A小的受个人实力和团队配合影响最大，保守打就是站在A小后点，等中路队友报t上A小或封中门烟后就反烟架枪，假如t没抢A大的话还可以摇一个A大的队友回来，对自己有自信的可以顶A小，顶A小放在下面的打法里讲\nA大是沙二这张图最关键的地方没有之一（再次一级是B1，在下面讲顶B1的打法里讲），从总体上看，A大是一个田字形地图，但事实上中路对A大是几乎没有影响的，t即使丢失了中路控制权也可以在中远以优势架住前压的t，这就导致ct丢失A大控制权之后只能通过A平台反清（相当于不能反清），所以说，A大破了就相当于这把t主攻A（大概率不会转点，因为A大要往B转被偷的可能性太多了，t没必要冒这个险），请第一时间支援A包","t慢打打法#t慢打打法":"由于t是进攻方，所以t基本没有默认，要硬说有，那就是控中路，rush的战术就不讲了，感觉没必要讲，所以就讲慢打吧，就当另一种默认\nt要控中路时，需要给出中门烟（匪家给或暗道给区别都不大，但要求封满，不然就是沙地ct狙优势点名抽人），有必要时给出A小火（假如ct顶A小不给前点烟的话，那他踩到火基本就是送了）\n在第一时间不rush的话，匪通过控中远变相地控住了A门，那么此时控B就需要t单摸，通常一个就好，这个t需要负责保证B包内的ct不会压出来，同时也起到辅助清B1的作用，当控下B1时，中路控制权就基本在t手上了，同时单摸的t也需要在ct顶A小的时候及时通知控中路的队友，或者把队友卖了收掉这个顶A小的ct\n以上","旋梯上-旋梯下#旋梯上-旋梯下":"t优势\n当ct选择顶B1时，双方会在此交火，这里也是t在rushB时经常翻车的点，t要反制很简单，只要对着旋梯烧个火就行了\n假如t在非rushB时要预防这里交火，就需要走暗道的人在暗道的箱子后跳看中门，在封中门烟控制中路时一并把B1控下","第一时间交火点#第一时间交火点":"对于任何一种默认打法来说，首要目的就是拿到最大的图权，哪一方在第一时间交火时胜出了，哪一方就能拿下这片区域的优势，所以这里先从第一时间交火点说起\n解释一下第一时间交火点，就是当ct与t第一身位都以最快速度抢占这些点时，双方会在此处交火（所以以下提到的ct和t都是第一身位）\n这张地图的第一交火点分别是（中门对狙的不算）：B通-B包，旋梯上-旋梯下，A小/B1-L位/中远，A门-A大拐角，主要的控图也就围绕这些位置展开","顶a小#顶A小":"这种打法通常在双方全起局出现，目的是拿到首杀让t开局减员，最好有两个ct配合，风险低\n站A小的在A小箱子上（图上叫躲闪位）给出A小前点烟用于留后路，同时也可以预防可能到来的默认A小火，随后在A小拐角往中路弹一颗闪（往对面中路的墙弹或往A小的墙弹都行，只要能白中路就是有效的，难度也不大），切枪出来刷人即可（短枪就不要顶A小了，老老实实顶B1吧），这时通常可以抓到中远往L位走的t，暗道封中门烟出来的t的timing，假如这局t选择快速上A小，此时也可能看到n个人按住w往A小冲，由于前面打了闪所以可以直接偷正面，通常拿到一个击杀就可以回来了（因为顶完A小中路信息也吃完了，大赚）\n假如有一个ct可以配合，这个ct就需要去顶B1，当然，由于主要目的不是清B，所以这个顶B1的只要站住B1架旋梯防t单摸就行，假如顶A小的ct报t上A小的话，这个B1的ct还可以从B1补枪补道具\n这种打法是警优势，通常也是ct开局控中路必做的流程，但这种打法要求顶A小的ct击杀效率要高，否则容易把A小直接丢掉","顶b1#顶B1":"这种打法通常在ct的eco局出现，目的是快速清空B通，要求至少2个ct，风险高\n主B的ct可以给出B通假火（烧B洞-B包间左侧的拐角），因为警火范围小的特性不会封住B洞入口，同时也可以给可能在B的t提示\"这把烧了B通火，所以不要rush了\"，随后主B的压进B洞，当然不给这颗火也是可以的，这颗火主要起心理博弈的作用，对野牛玩家无效\n中路侦察的ct就放中路，改为开局进中门贴墙进B1（顶B1的核心），随后直接走旋梯和主B的人夹击B通里的匪\n这种打法是警劣势，匪道具占优，前面提到了匪可以通过烧旋梯火来防顶B1，所以这种打法主要是出其不意，通常一把里只能用两三次"},"title":"cs炙热沙城二打法概述"},"/game/godot_a_star/":{"data":{"":"以下写的是四连通的情况，但其实完全可以类推到六连通和八连通\n首先是Astar寻路的四个要点：\n寻路消耗公式f = g + h（虽然我并不知道为什么一定是这三个字母而不是a = b + c） open开启列表 close关闭列表 反向遍历","open开启列表和close关闭列表#open开启列表和close关闭列表":"open用来存储已访问但未放入路径的格子，close用来存储放入路径的格子，Astar计算出的路径就是close的子集\nopen通常需要包含的数据有：计算格父级的坐标，计算格的f，g，h，计算格的坐标 close需要包含的数据有：计算格父级的坐标，计算格的坐标","三个距离#三个距离":"欧几里得距离（欧氏距离）的计算公式是横坐标差的平方加纵坐标差的平方的和开根号，当对ai体的灵活度有要求时，就会用这个距离代表g\n曼哈顿距离的计算公式是横坐标差的绝对值加纵坐标差的绝对值，一般用来衡量计算点到终点的远近\n切比雪夫距离没有很明确的计算公式，如果非要有的话那应该就是对经过的所有格子的消耗求和，所以一般说到消耗都是切比雪夫距离","代码实现#代码实现":"(约定地图起始格子坐标为(0,0)，那么(-1,-1)格即为不存在格，用作初始化)\n首先我们需要明确一下格子类内包含的变量是哪些\nextends Node_2D class_name Grid var index : Vector2i var cost : float var parent : GridManager func initialize(parameter : GridManager) -\u003e void: parent = parameter #这里是依赖注入的写法，写习惯了带一笔 接下来是GridManager的脚本，A*算法主要得从这里根据坐标返回格子对象\nextends Node class_name GridManager var parent : Node #这里的是GridManager的父级 func initialize(parameter : Node) -\u003e void: parent = parameter for child in get_children(): if child is Grid: child.initialize(self) func index2grid(index : Vector2i) -\u003e Grid: for child in get_children(): if child is Grid: if child.index == index: return child 接下来就是寻路算法的核心脚本，输入管理器、起点和终点坐标，输出接下来要走的坐标，具体看注释，这里不赘述了\nextends Node class_name AStar func main(grid_manager : GridManager , start_index : Vector2i , end_index : Vector2i) -\u003e Vector2i: #明确算法的输入输出 var result : Vector2i #结果 var open_list : Dictionary var close_list : Dictionary #这里明确这两个list中的数据结构分别为{计算点坐标 : [[计算点父级坐标] , [f,g,h]]}和{计算点坐标 : 计算点父级坐标} open_list[start_index] = [[Vector2i(-1,-1)] , [get_MHD(start_index , end_index),0,get_MHD(start_index , end_index)]] #初始化open_list var end_flag : bool = false while end_flag == false: var best_element_index : Vector2i = get_best_element_index(open_list) var best_element_parent_index : Vector2i = open_list[best_element_index][0][0] #以上是对open_list的处理 close_list[best_element_index] = best_element_parent_index #把最优格放入close_list var cross_grids_index : Array[Vector2i] = get_cross_grids_index(grid_manager,best_element_index) for cross_grid_index in cross_grids_index: var cross_grid_index_dictionary : Dictionary #数据结构为{计算点坐标 : [f,g,h]} var g : float = grid_manager.index2grid(cross_grid_index).cost + open_list[best_element_index][1][1] var h : int = get_MHD(cross_grid_index,end_index) var f : float = g + h cross_grid_index_dictionary[cross_grid_index] = [f,g,h] #这个要着重看，精髓在此 open_list[cross_grid_index] = [[best_element_index] , cross_grid_index_dictionary[cross_grid_index]] #处理父级 if h == 0: close_list[end_index] = best_element_index end_flag = true break open_list.erase(best_element_index) #记住一定要删，不然会重复选中 if open_list.size() == 0: return Vector2i(-1,-1) end_flag = false result = end_index while end_flag == false: if close_list[result] == start_index: end_flag = true return result result = close_list[result] #下面补充工具函数 #这个函数的目的是返回open_list中的最优元素的格子坐标 func get_best_element_index(open_list : Dictionary) -\u003e Vector2i: var result : Vector2i = Vector2i(-1,-1) var f_result : Array[Vector2i] = [] #用于存储比较值可能重复的结果 var calculation_index : Array[Vector2i] var calculation_index_parameter : Array[Array] var min_f_index_array : Array[Vector2i] var min_g_index_array : Array[Vector2i] var min_h_index_array : Array[Vector2i] for key in open_list.keys(): calculation_index.append(key) calculation_index_parameter.append(open_list[key][1]) for index in calculation_index: if result == Vector2i(-1,-1): result = index #这里是初始化 var num : int = calculation_index.find(index) #这个是计算点坐标的索引 var result_num : int = 0 if calculation_index_parameter[num][0] \u003c= calculation_index_parameter[result_num][0]: result = calculation_index[num] result_num = num f_result.append(result) if f_result.size() == 1: return result else: var g_result : Array[Vector2i] = [] for index in f_result: var num : int = calculation_index.find(index) var result_num : int = 0 if calculation_index_parameter[num][1] \u003c= calculation_index_parameter[result_num][1]: result = calculation_index[num] result_num = num g_result.append(result) if g_result.size() == 1: return result else: var h_result : Array[Vector2i] = [] for index in g_result: if calculation_index_parameter[num][2] \u003c= calculation_index_parameter[result_num][2]: result = calculation_index[num] result_num = num h_result.append(result) if h_result.size() == 1: return result else: var size = h_result.size() var random_num = randi(0,size) return h_result[random_num] #这里的f,g,h属实屎山了,但没办法,为了理解简单就这样写吧，反正就是优先找f最小，然后g最小，最后h最小，假如有都相同的，那就随机返回 #这个函数的目的是返回目标坐标四连通区域的格子坐标 func get_cross_grids_index(grid_manager : GridManager,best_element_index : Vector2i) -\u003e Array[Vector2i]: var result : Array[Vector2i] var directions : Array[Vector2i] = [Vector2i(0,1),Vector2i(0,-1),Vector2i(-1,0),Vector2i(1,0)] for direction in directions: target : Vector2i = best_element_index + direction if grid_manager.index2grid(target): result.append(target) return result #这个函数的目的是得到两个坐标间的曼哈顿距离 func get_MHD(start_index : Vector2i,end_index : Vector2i) -\u003e int: return abs(start_index.x - end_index.x)+abs(start_index.y - end_index.y) 英明神武的ai大人告诉我我写的代码非常屎，是的，它是对的，以上的代码仅仅停留在能看和能用的阶段，距离好用还差很长的一段距离，比如其中某些函数有更好的写法，某些地方缺乏健壮性等（其实我不喜欢这个词，我就理解为更安全更经得住乱造）\n但没关系，本篇仅供用于参考A*算法的思路，至于写进游戏，还需要更多的适配性（比如Grid和GridManager还需要优化等）\n（狗头叠甲）\n以上","实现理论过程#实现理论过程":"前提：假设所有格子都继承于一个类Grid(父类是Node2D)，访问格子时可以访问到它的坐标，移动消耗，同时有一个格子管理器GridManager(父类是Node)，所有格子都是这个管理器的子节点\n我们要求Astar脚本的核心功能：输入起点和终点坐标，格子管理器的引用，若寻路成功，输出下一步要移动到的格子坐标\n步骤如下：\n把起点放入开启列表中 开始循环，在开启列表中寻找f最小的最优格，将其放入关闭列表，并从开启列表中移除（可能会存在有几个格子的情况，所以这里存储找到的格子需要是一个列表，但返回到后续过程的结果一定是一个格子，假如f相同就找h，再相同就找g，再相同就随机） 遍历最优格四连通区域的格子，将这些格子放入开启列表中（需要注意一下放入到开启列表中的元素，最优格的坐标会作为这些放入开启列表的格子的父级坐标一并放进去） 持续循环，直到开启列表为空或最优格为终点，若开启列表为空，则返回寻路失败，若最优格为终点，则寻路成功，则将终点放入关闭列表并结束循环 反向遍历，从关闭列表的最后一个元素（即终点）开始，访问其计算格父级坐标，与关闭列表中元素的计算格坐标比对，以此找到其父级，以此循环，知道访问到父级坐标为起点坐标时结束遍历，返回计算格坐标，即为输出","寻路消耗公式#寻路消耗公式":"f = g + h\n其中，f为寻路消耗，g为起点到计算点的切比雪夫距离，h为计算点到终点的曼哈顿距离\n为什么是切比雪夫距离？经典的版本是欧氏距离，但依旧如题，这里要涉及到消耗，所以我会更偏向使用切比雪夫距离，下方解释一下三个距离"},"title":"基于Godot的A*寻路算法"},"/game/godot_code_framework/":{"data":{"":"在写最近的项目Illness时，我在这个游戏中同时使用了两种架构（也不能说是架构？应该说是编程模式），一种是我写以前的项目常用的，另一种是突发奇想的，我们重点讨论后者\n它的核心在于对global脚本和变量set函数的使用\n众所周知，在游戏中大量使用global脚本是并不提倡的，因为它在程序开始时就会被加载且在退出程序前不会被free，那么在游戏的大部分时候，global脚本都是只占内存但不发挥作用，而且它还会拖慢游戏的启动时间\n诚然如此，但在某一天我看到了这个视频：\nBest Code Architectures For Indie Games\n这个视频是《王座陨落》开发者在油管投的视频，b站上有很多熟肉，随便搜搜也能看到\n这里说的独立系统+胶水的架构中，独立系统可以看作是每个对象的manager，而胶水在godot中就可以对应global脚本，这就是我们将要讨论的架构","global脚本的逻辑#global脚本的逻辑":"假如你在编辑器中测试你的游戏时细心点的话，可以看到\"远程\"栏位中除了当前场景的节点外还有一个Node节点，这些Node节点就是编辑器自己创建的附加了global脚本的可以全局访问的Node节点（所以godot的核心仍没有变，依旧是node-base）\n你可以理解为编辑器在创建了这个\"全局Node\"后，再拉了一根飞线连到所有节点上，让场景中的任何节点都可以直接访问这个\"全局Node\"","框架实践#框架实践":"现在我们假设要设计一个系统，当鼠标悬浮在卡牌上时，在一个面板中显示卡牌的细节内容\n在此约定卡牌父类为Card，继承于Control，内含细节变量detail : String，面板为DetailPanel\n在往常，或许我们的思路是：\n卡牌父类中存有对DetailPanel的引用（这个写法很屎山，真要写项目的时候不要这么写，我们这里只是简化条件） 卡牌父类中有一函数连接到信号mouse_entered DetailPanel中有一函数，可传入卡牌的引用或直接传string来展示卡牌细节 当mouse_entered触发时，调用DetailPanel的展示函数并将卡牌的引用或细节变量的值传入 是的，这个流程是合理的，而且卡牌将细节变量的值传过去的情况是开销最小的流程\n那么，假如这时候我加一个要求，要让展示卡牌细节时还要连带着展示卡面呢（这种情况是有的，详见《游戏王》）\n这个时候直接传细节变量的值进去就不管用了，这时候直接传卡牌的引用明显是最简单且开销最小的\n好的，那么更刁钻的要求就来了，假如我现在有一种卡牌，它使用后的效果是将某个指示物放在场上某处，要求是鼠标悬浮在指示物上时，显示卡牌的细节（这种情况也是有的，详见《三国杀》）\n哦，那确实难办起来了，因为指示物显然是不能继承于Card父类的，那该怎么办？\n或许这样也能继续写下去，在指示物里存有对创造者卡牌的引用和对DetailPanel的引用，当鼠标悬浮在指示物上时，将创造者卡牌传给DetailPanel…但是假如我又要求指示物的指示物呢🌚上面说了存有对DetailPanel的引用已经很折磨了，这样嵌套下去只会更折磨\n好的，那么就得把上面的框架都掀了，来试试最新的框架吧\n有一global脚本，存有变量current_hover_card，类型是Card，有一set函数，当值改变时，更改DetailPanel中的相应变量（这里为了简化就同名） DetailPanel中有一变量current_hover_card，有一set函数，当值改变时，更改展示内容为Card（两个set函数或许有些冗余了，但这样最终写出来代码也是很简洁的，当然，你想直接在global里调DetailPanel中的函数也行，只是越界了不太好） 卡牌父类中有一函数连接到信号mouse_entered，触发时更改global脚本中的current_hover_card 指示物中存有对创造者卡牌的引用，有一函数连接到mouse_entered，触发时更改global脚本中的current_hover_card 如此这般，或许你要问了，不是说存有DetailPanel的引用是很折磨的写法吗，为什么我还是在global里这样干了\n哦，这里可不同了，由于所有node都可以随时随地修改global脚本，那么我们只需要在DetailPanel的_ready时将本身传给global脚本就行了（受依赖注入写法的熏陶，我会更习惯于专门写个initialize，但这无关紧要），所以说，要global存有对节点的引用只需要一行代码就行了\n以上"},"title":"Godot或许合格的程序架构"},"/game/nine_kings/":{"data":{"":"游戏类型：肉鸽+回合制卡牌+自走棋（+城市规划？）\n画风：像素风\n一句话总结：像小丑牌一样，很让人爽，但没有长时间深入玩的意愿，有尽爽游","九格系统#\u0026ldquo;九\u0026quot;格系统":"游戏中最核心的系统，其实就是格子系统，游戏中称\"地块”，玩家只有一种手段主动强化自己的势力，就是将手牌使用到至多5x5个地块中（初始为3x3个地块，故而称\"九\"格，但可以通过各种手段扩展地块，上限是5x5，敌人会无止境增强，且增强速度会在某时大于玩家增强速度，所以玩家注定会失败）\n所有手牌均是一次性的，使用单位牌会在该地块上创造一个单位群（游戏中的单位数量较多），使用构筑物牌会在该地块上创造一个相应的构筑物，使用buff会给该地块上的单位/构筑物加上一个永久buff，直到失去该地块上的单位/构筑物（游戏中有可以摧毁地块上的单位/构筑物的牌）\n特殊地，每个单位和构筑物均有三个等级，玩家可以通过将与某个地块相同的牌作用到该地块上来升级该地块，升级会带来面板增益，该增益不会失去，地块升级到三级后不可继续升级，buff牌可以无限叠加到一个地块上\n特殊地，游戏中存在一张可以降低等级数的buff牌（类似于小丑牌的\"负片\"效果）\n格子只会增多，不会减少，解锁的格子可以不相邻 格子的\"相邻\"是四连通\n位置相关举例： 设游戏中有一3x3格\n农田 军队A 军队E 军队B 墓地 军队C 森林 军队D 铁匠铺 其中，\n墓地：相邻地块单位死亡时，在原位生成一个\"小鬼\"（可以理解为炮灰级部队）\n农田：每回合结束时，给随机相邻军队增加一个单位\n森林：每回合结束时，相邻军队生命值+2%\n铁匠铺：每回合结束时，相邻军队伤害+2%\n军队E：当相邻军队增加单位时，自己增加相应数量的单位\n则军队ABCD每回合都分别有农田森林铁匠铺的一次次强化，军队E在军队A获得农田增员加成时也获得加成","养成系统特权系统#养成系统（特权系统）":"游戏外初始只能选择一个国王（代表势力），随着玩家达到某些目标（如消灭9999军队，建造99建筑等），某些国王会相应地解锁，可选国王有9个\n游戏中养成系统主要在\"特权\"中，玩家在游玩一轮游戏结算时，会为本轮使用的国王增加经验，经验用于升级，升级会获得\"专属特权\"和\"通用特权\"两种特权，其中通用特权为每个国王均可使用，专属特权为仅该国王使用\n（类似于铭文系统）\n玩家需要在进入一轮游戏前配置所选国王的特权，每个国王限9个特权\n举例：\n通用特权：所有军队攻击速度+10% 通用特权：游戏开始时随机解锁一个位置的地块 通用特权：获得3次免费重掷次数 通用特权：所有通用特权效果x2 专属特权：游戏开始时随机在一个地块里生成\"恶魔祭坛\"（某个国王的构筑牌） 专属特权：游戏开始时获得一张\"小鬼\"（某个国王的军队牌） 特殊地，有的特权会根据位置影响其他特权，为扩展，此处不赘述 （如：此特权的相邻纵向特权效果x2）\n以上","势力系统#势力系统":"游戏中共有9个可选势力和1个不可选的彩虹势力，每个势力均有9张牌（彩虹势力不知道，但应该也有9张）\n其中每个势力（除彩虹势力外）固定有一个主城\n游戏开始时玩家固定获得该势力的主城卡，在玩家使用该主城卡后（即在初始格中建造主城），玩家将获得3张随机的该牌开始第一轮游戏（这个数字可以通过养成而改变），随后开始循环，直到失败","基本玩法#基本玩法":"游戏是回合制，以手牌数=2标志本回合结束，回合结束时会有交战，交战后玩家会从三张卡牌中自选一张，回合中玩家需要使用卡牌强化自己的实力，再迎接下一次交战，以此为游戏主循环","年份系统#年份系统":"作用于战斗结束时 每一个回合相当于一年，有些年份会有特殊效果，在年份开始时（可以简单理解为回合开始时），这个效果将会生效（均为一次性效果）\n举例：\n祈福：在n年后会有某些效果 （如：9年后某地块的军队生命值翻倍，9年后某地块的军队数量翻倍）\n政策：玩家从三个效果中选择一个生效 （如：部队暴击效果增加50%，立即解锁三个地块，获得99金币，恢复玩家生命值）\n解锁地块（玩家选择一个地块解锁）\n商店（玩家消耗金币购买卡牌）","战斗系统#战斗系统":"作用于回合结束时（即手牌数=2时）\n游戏中的战斗是全自动的，玩家能直接影响到战局的手段只有\"主城\"的效果（如虚无之王的主城效果是有冷却地往玩家鼠标指示处丢出落石，死亡之王的主城效果是有上限地在玩家鼠标指示处召唤作战单位，玩家只会有一个主城）\n在回合结束时，玩家场上的单位会往战场自动排兵布阵（肉盾往前，输出往后），在战场上的另一边会出现一队某个势力的军队（玩家可以提前知道是哪个势力，但不可提前知道军队的具体信息，这个靠背板，即某个势力会固定出某些种类的军队，只不过数量和面板数值不同），双方自动战斗，当敌方军队全灭，玩家胜利，当敌方军队攻进玩家主城，玩家失败，失去1生命值（玩家初始有3生命值，生命值为0时本轮游戏结束）\n特殊地，玩家场上的构筑物有防御塔类时，这些防御塔也会帮助玩家攻击（但没有血量）","战斗结束后的三选项选牌#战斗结束后的三选项选牌":"（战斗结束后立刻生效） 玩家会获得3个卡牌选项（可以通过某些手段提高这个数），这些卡牌来自于战斗中交战的势力（也是充分利用到了其余势力的牌嗷），玩家可自选其中一项获得（有某些手段可以让玩家失去选择机会而随机获得两张牌）\n特殊地，玩家有消耗\"金币\"重掷的选项","核心系统#核心系统":"游戏中共有：\n单位： 军队，构筑物（建筑）两种可以放在格子中的单位\n手牌： 军队牌，构筑物牌，buff牌三种手牌","流程图#流程图":"","经济系统#经济系统":"游戏中的经济系统很小\n只有以下常规手段获取金币：\n有\"击败敌人时有2%的概率获得1金币\"buff的军队击败敌人（该buff也是一张牌，需要附加到自己的军队上）\n构筑物\"金库\"：每回合获得3金币\n每回合固定收入\n只有以下常规手段消耗金币：\n年份效果为\"商店\"时消耗金币购买卡牌或重掷卡牌\n消耗金币重掷战斗结束时的三选项卡牌\n无限肉鸽阶段消耗金币解锁地块\n特殊地，游戏中存在与金币相关的buff（如每获得1金币则获得n增益），为扩展，此处不赘述"},"title":"九王"},"/game/stick_to_an_isolated_city/":{"data":{"":"游戏类型：RTS?+塔防?+自走棋?\n画风：国风+水墨风\n一句话总结：有些卖ip的意思，玩法没有很大的创新性，对RTS的简化值得借鉴\n主题：采集资源，建造军队，防御攻击\n（吐槽一下，优化真的烂）","乌薪#乌薪":"完全同\"石材\"，只不过量更少","产业链#产业链":"是一种只有顶级建筑一次性生产，专门用于升级顶级部队的个位数资源\n（这个资源让玩家必须去考虑建造顶级建筑，导致建筑种类实在太多了，而且这些顶级建筑还基本不可复用，占地又大，到了游戏后期根本没有地方放这些东西，又联动了它一个细节：不同类建筑必须间隔1格距离，导致玩家左右为难或许要拆一些建筑，难评）","人口#人口":"是一次性生产的少量资源\n游戏中的人口有且仅有住房类建筑能提供，同时住房类建筑会提供水墨，可以理解为水墨增长和人口增长是成正比的\n人口是建造某些生产类建筑所需的资源，如伐木场（木材），猎人小屋（食物），采石场（石材），墨薪采矿场（墨薪） 是训练军事单位所需的资源","军队的养成系统#军队的养成系统":"类皇室战争卡牌收集与升级\n高级的卡牌（包括建造的建筑和训练的军队的初始数值）会有更好的面板数值\n由于游戏中的建筑只有种类区别不会升级，军队升级只涉及buff，故而这些不会受到该养成系统的影响而增加复杂度","军队的羁绊系统#军队的羁绊系统":"基本照抄自走棋，玩家招募拥有相同羁绊标签的单位达到2，3个时会获得额外收益\n相当于给军队的预设方案和局内招募的选择加了变数","军队系统#军队系统":"感觉更像3选项肉鸽机制+RTT的结合\n为什么像RTT？游戏中的军队系统更强调\"派哪些部队守哪些点\"，在游戏中玩家通过拖拽军队的图标指示军队向某些特定的地方移动（特殊地，存在建筑类型的军队，玩家需要通过有冷却无消耗地建造来部署这些建筑），单位会在该地自动攻击并坚守，直到死完或者玩家将他们移动到其他地方（像王座陨落）\n3选项肉鸽机制在哪？游戏中玩家需要消耗资源来\"训练\"军队，在这个训练系统中，玩家可以招募新的军队/升星已有军队或为已有军队添加buff，这两个动作的出现频率为1：1，即第一次训练时为前者，下一次训练就为后者，以此反复\n游戏中训练的消耗是单调无函数递增的，从\"水墨+人口\"到\"水墨+人口+粮食+木材+石材+墨薪\"种类和数量均递增","地图系统#地图系统":"游戏中的地图仅涉及到\"探索\"这一机制\n游戏中的地图不是程序化生成的，而是固定的地图\n不涉及RTS中的\"视野”，所有探索过的地图常亮\n在游戏开始时，玩家会有一片照亮城镇中心的已探索区域，玩家可以消耗水墨从任何已探索区域临接区域向外探索（该水墨消耗根据将探索的地块数量无规则递增，在游戏初始阶段这个值会很小，即使要探索的区域很大），探索会点亮一定数量的地块，这个地块的区域大小是程序化生成的，但其内容不是（因为地图永远是固定的），该地块会在玩家将要探索时用虚线指示出来（参照海岛奇兵）\n以上","木材#木材":"是周期性生产的大量资源\n游戏中的木材由伐木场类建筑提供，同\"猎人小屋”，只不过其生产资源是周期性的","水墨#水墨":"可以广义地理解为\"钱\"，基本所有建筑建造，单位训练，地图扩张都需要\"水墨\"","游戏主玩法#游戏主玩法":"游戏玩法流程和RTS是一个模子刻出来的，至少我玩到整个游戏关卡流程的一半还没看到更多的机制或系统","石材#石材":"是周期性生产的少量资源\n游戏中存在\"石头\"地块，在该地块上建造采石场类建筑，保证石头在采石场影响范围内即可为玩家周期性地提供石材资源","科技研究系统#科技/研究系统":"一个用于标志游戏进度，简化原有的复杂的建筑系统，提供及时奖励的系统\n游戏中用于研究的资源为\"经验值\"，该资源可以通过建造建筑，升级建筑，训练军队，击杀敌人等各种方式获得，且仅用于研究，泛用性和与其他资源的联系程度低，故而在经济系统里没有提到该资源\n研究系统通过城镇中心等级来标志游戏进度，玩家需要更高级的城镇中心来开启研究更多选项\n在游戏外，玩家可以解锁非常多的建筑可供建造（涉及卡牌收集与养成），这些建筑如果一股脑地塞到玩家可建造的列表里，会让玩家直接删除游戏，于是有了这样一个研究系统，玩家只能通过研究系统开启建造更多的建筑，起始玩家可以建造的建筑只有用于早期资源循环的\"民宅\"和\"农田\"，在研究后，玩家才能解锁更多诸如\"伐木场\"，“猎人小屋”，“二级城镇中心”，“采石场\"及各类城墙的建造，这些可研究选项的生成是根据当前科技树不完全随机出来的，选项个数不固定，有1（必选研究）~6项不等，有些科技需要前置科技或前置建筑才能刷出来或研究\n科技研究中有一个获得资源的选项，相当于玩家可以放弃本次科技研究选择获得一些资源用于应急","粮食#粮食":"是一次性生产的少量资源\n游戏中的粮食由\"农田\"和\"猎人小屋\"提供\n其中\"农田\"仅消耗水墨，是游戏开始时必造的主要建筑，“猎人小屋\"消耗人口，水墨，木材，是游戏中期生产粮食的主要建筑\n对于\"农田”，游戏中设定了\"肥沃度\"系统，每一个空地地块都有一个\"肥沃度\"值，特别地，肥沃度为0的空地即为\"荒地\"，在只有荒地的地块无法建造农田\n肥沃度仅由地图决定\n对于\"猎人小屋\"，其存在一个\"影响范围\"，在该影响范围内的树木会为玩家提供一次性的粮食值，树木量与粮食量关联函数暂未知，反正多多益善\n特殊地，猎人小屋的影响范围不能重叠（要求玩家通过合理城市规划来最大化资源生产）\n是建造住房类建筑的核心资源，前期的资源循环存在于\"水墨\"-\u003e“粮食”-\u003e“人口”+“水墨\"中","经济系统#经济系统":"游戏中有以下资源种类： 人口，粮食，水墨，木材，石材，乌薪，产业链（纯纯的败笔）\n其中，除人口和粮食之外，其他资源均以\"天\"为回合单位，依回合结束时的资源增长数获得 （每天为15秒）"},"title":"墨守孤城"}}